export const KillCharacter = [
    "白雪皑皑", "三年之艾", "斩关夺隘", "方兴未艾", "方来未艾", "方滋未艾", "期期艾艾", "车填马隘", "冥昭瞢闇", "狂吠狴犴",
    "把酒持螯", "深山野墺", "沿门托钵", "沿门持钵", "沿门讬钵", "如丧考妣", "若丧考妣", "三等九般", "吹垢索瘢", "吹毛索瘢",
    "洗垢求瘢", "洗垢索瘢", "索垢吹瘢", "一手包办", "七棱八瓣", "乔妆打扮", "乔妆改扮", "乔装打扮", "乔装改扮", "公事公办",
    "咄嗟便办", "咄嗟立办", "多多益办", "梳妆打扮", "腹诽心谤", "腹非心谤", "薏苡之谤", "薏苡蒙谤", "飞谋荐谤", "飞谋钓谤",
    "俗谚口碑", "有口皆碑", "一班一辈", "当今无辈", "无名小辈", "等闲之辈", "论资排辈", "超群越辈", "进退狼狈", "鼠雀之辈",
    "心拙口夯", "五内俱崩", "从恶如崩", "从恶是崩", "从恶若崩", "地坼天崩", "坐吃山崩", "栋折榱崩", "栋朽榱崩", "海啸山崩",
    "海沸山崩", "瓦解土崩", "礼坏乐崩", "离析分崩", "鱼烂土崩", "左辅右弼", "断简残编", "断简遗编", "蠹简遗编", "分路扬镳",
    "分道扬镳", "将虾钓鳖", "瓮中之鳖", "瓮中捉鳖", "证龟成鳖", "一字褒贬", "不置褒贬", "掩骼埋窆", "笔削褒贬", "举鼎绝膑",
    "文质斌斌", "率土之滨", "问诸水滨", "五花大绑", "挨肩擦膀", "一浆十饼", "传为笑柄", "充饥画饼", "宝珠市饼", "尺寸之柄",
    "授人以柄", "热熬翻饼", "百年之柄", "不值一驳", "东飘西泊", "名垂竹帛", "垂名竹帛", "大气磅礴", "子女玉帛", "杀鸡抹脖",
    "束发封帛", "气势磅礴", "永垂竹帛", "著于竹帛", "解衣盘礴", "解衣磅礴", "解衣般礴", "陆离斑驳", "鱼书雁帛", "鸾漂凤泊",
    "鸾飘凤泊", "含冰茹檗", "饮冰吞檗", "饮冰茹檗", "饮冰茹蘖", "饮冰食檗", "饮冰食蘖", "入铁主簿", "白色恐怖", "通都大埠",
    "吹毛求疵", "吹毛索疵", "大醇小疵", "完美无疵", "批毛求疵", "披毛求疵", "澡垢索疵", "索垢寻疵", "饰垢掩疵", "尸禄素飡",
    "三马同槽", "水落归槽", "水落归漕", "牛骥同槽", "人心叵测", "人心莫测", "人心难测", "人手一册", "令人莫测", "以防不测",
    "变化不测", "变化莫测", "变幻不测", "变幻莫测", "变生不测", "天年不测", "居心叵测", "心怀叵测", "深不可测", "深奥莫测",
    "玄妙莫测", "神妙莫测", "神鬼不测", "神鬼莫测", "神鬼难测", "管窥蠡测", "诡秘莫测", "连篇累册", "险遭不测", "风云不测",
    "风雨不测", "高文典册", "高文大册", "高深莫测", "鬼神不测", "鬼神莫测", "牛蹄之涔", "魂惭色褫", "九年之储", "儋石之储",
    "家无斗储", "断墨残楮", "断缣尺楮", "镂脂翦楮", "七步八叉", "啛啛喳喳", "笑面夜叉", "虎党狐侪", "诗酒朋侪", "雨僽风僝",
    "鬼刻神劖", "心惊胆颤", "滴水不羼", "花枝招颤", "魂惊胆颤", "魂飞胆颤", "毁冠裂裳", "矮人观场", "矮子观场", "颠倒衣裳",
    "为虎作伥", "男盗女娼", "逼良为娼", "旁通曲鬯", "神流气鬯", "刁钻促搯", "掐尖落钞", "露纂雪钞", "天崩地坼", "山崩地坼",
    "潮鸣电挚", "吉日良辰", "日月参辰", "满腔热忱", "牝哹鸣辰", "献曝之忱", "生不逢辰", "神魂荡飏", "美景良辰", "逢吉丁辰",
    "霜露之辰", "西赆南琛", "释缚焚榇", "面缚舆榇", "以酒解酲", "袒裼裸裎", "一口两匙", "伯埙仲篪", "如埙如箎", "如埙如篪",
    "垂头塌翅", "猛虎插翅", "簠簋不饬", "雏鹰展翅", "麟角虎翅", "倾家破产", "倾家竭产", "倾家荡产", "倾家败产", "分家析产",
    "分烟析产", "弃家荡产", "破家丧产", "破家竭产", "破家荡产", "破家败产", "忧心忡忡", "十里洋场", "效死疆场", "矮人看场",
    "粉墨登场", "血染沙场", "袍笏登场", "驰骋疆场", "不解之仇", "不记前仇", "九世之仇", "借交报仇", "借客报仇", "借箸代筹",
    "借身报仇", "公报私仇", "公报私雠", "切骨之仇", "反目成仇", "同业相仇", "啸侣命俦", "嫉恶如仇", "嫉恶若仇", "嫉贪如雠",
    "官报私仇", "敌忾同仇", "旧恨新仇", "枕干之雠", "海屋添筹", "燕侣莺俦", "略胜一筹", "略逊一筹", "略高一筹", "疾恶如仇",
    "疾恶如雠", "疾恶若雠", "稍胜一筹", "稍逊一筹", "聊胜一筹", "腼颜事仇", "莫展一筹", "血海深仇", "行思坐筹", "视为寇雠",
    "视如寇仇", "解剑拜仇", "贸首之仇", "贸首之雠", "通计熟筹", "雪耻报仇", "靦颜事仇", "高人一筹", "高出一筹", "鸾交凤俦",
    "两脚书橱", "搔首踟蹰", "有脚书厨", "有脚书橱", "立地书厨", "立地书橱", "左支右绌", "心余力绌", "相形见绌", "离离矗矗",
    "财匮力绌", "大笔如椽", "笔大如椽", "茅屋采椽", "隔壁撺椽", "隔屋撺椽", "反朴还淳", "反正还淳", "返朴还淳", "卑鄙龌龊",
    "卑陋龌龊", "不偢不倸", "不揪不採", "不揪不睬", "不瞅不睬", "土阶茅茨", "三回五次", "三番两次", "三番五次", "不可造次",
    "不敢造次", "栉比鳞次", "言无伦次", "语无伦次", "语无诠次", "贯鱼之次", "超阶越次", "鲍鱼之次", "行色匆匆", "行色恠恠",
    "郁郁葱葱", "七拼八凑", "东拼西凑", "东挪西凑", "东补西凑", "四方辐辏", "枉曲直凑", "车马辐辏", "味同嚼蜡", "龙腾虎蹴",
    "如切如磋", "相切相磋", "人亡邦瘁", "人文荟萃", "冰清玉粹", "出类拔萃", "出群拔萃", "单忧极瘁", "形容憔悴", "心力交瘁",
    "惙怛伤悴", "拔群出萃", "洗濯磨淬", "神郁气悴", "身心交瘁", "邦国殄瘁", "金昭玉粹", "鞠躬尽瘁", "鳞集毛萃", "鸟集鳞萃",
    "心如刀锉", "归根究柢", "归根结柢", "微文深诋", "深文巧诋", "深根固柢", "痛诬丑诋", "舞文巧诋", "传神阿堵", "观者如堵",
    "观者成堵", "闾阎安堵", "榆木疙瘩", "榆木圪垯", "严惩不贷", "妆嫫费黛", "榆木脑袋", "法无可贷", "百不一贷", "责无旁贷",
    "酒囊饭袋", "鸿毛泰岱", "一枕邯郸", "学步邯郸", "杀鸡取蛋", "一搭一档", "朝乾夕愓", "风流跌宕", "一尘不到", "先来后到",
    "家至户到", "意想不到", "新来乍到", "木鸡养到", "老成见到", "读书三到", "面面俱到", "面面圆到", "面面皆到", "高牙大纛",
    "龙幡虎纛", "蹑屩担簦", "蹑屩檐簦", "蹑躥担簦", "蹑躥檐簦", "击鞭锤镫", "坐冷板凳", "执鞭坠镫", "执鞭随蹬", "执鞭随镫",
    "三好两歹", "不知好歹", "不识好歹", "为非作歹", "作好作歹", "做好做歹", "力有未逮", "匡其不逮", "嫌好道歹", "根连株逮",
    "说好嫌歹", "说好说歹", "骈首就逮", "攒锋聚镝", "树元立嫡", "不存芥蒂", "乌衣门第", "书香门第", "归根结蒂", "心存芥蒂",
    "无了根蒂", "无根无蒂", "深根固蒂", "甘瓜苦蒂", "芙蓉并蒂", "角巾私第", "追根究蒂", "鄐诜高第", "鳏寡孤惸", "鸿都买第",
    "假痴不癫", "白圭之玷", "龙荒蛮甸", "松柏后凋", "绵绵瓜瓞", "行眠立盹", "孤苦伶仃", "瘦骨伶仃", "势不可挡", "横拦竖挡",
    "横遮竖挡", "不懂装懂", "不知藋蕫", "似懂非懂", "半懂不懂", "懵懵懂懂", "善颂善祷", "筚门闺窦", "荜门圭窦", "闭门塞窦",
    "上谄下渎", "匹夫沟渎", "案无留牍", "盈篇累牍", "联篇累牍", "苞苴竿牍", "辍毫栖牍", "还珠买椟", "连帙累牍", "连章累牍",
    "连篇累牍", "连篇絫牍", "连编累牍", "长篇累牍", "鸿函钜椟", "龟玉毁椟", "真金不镀", "观者如垛", "一刀两段", "不择手段",
    "碎尸万段", "绫罗绸缎", "元恶大憝", "寻行逐队", "成帮结队", "成群作队", "成群结队", "成群逐队", "蜂营蚁队", "随行逐队",
    "浑浑沌沌", "混混沌沌", "自相矛盾", "鬻矛誉榡", "东闯西踱", "悬鞀建铎", "悬鼗建铎", "毁钟为铎", "一箭上垛", "乘风转舵",
    "千刀万剁", "回船转舵", "毁舟为杕", "看风使舵", "见风使舵", "见风转舵", "趁风使柁", "避强击惰", "随风倒舵", "随风转舵",
    "顺风使舵", "顺风转舵", "凤靡鸾吪", "月里嫦娥", "侃侃谔谔", "在陈之厄", "成风尽垩", "抵瑕陷厄", "矜贫救厄", "砥锋挺锷",
    "藏锋敛锷", "见弹求鹗", "郢人斫垩", "年高德卲", "谋无遗谞", "言行不贰", "誓死不贰", "瑶环瑜珥", "遗簪坠珥", "遗簪堕珥",
    "三怨成府", "五脏六腑", "五藏六府", "冲州撞府", "冲州过府", "刿鉥心腑", "唇敝舌腐", "感人肺腑", "感深肺腑", "推枯折腐",
    "摧枯折腐", "摧枯拉腐", "文宗学府", "沁人心腑", "沁人肺腑", "深铭肺腑", "清虚洞府", "清都紫府", "玄酒瓠脯", "胸无城府",
    "胸有城府", "贯朽粟腐", "铭诸肺腑", "阴曹地府", "餐腥啄腐", "人困马乏", "周急继乏", "家道消乏", "振贫济乏", "赈贫贷乏",
    "占风使帆", "看风使帆", "羝羊触藩", "见风使帆", "返辔收帆", "顺风使帆", "顺风张帆", "顺风扯帆", "蜗舍荆扉", "五典三坟",
    "治丝益棼", "治丝而棼", "负土成坟", "青竹丹枫", "不事边幅", "不修边幅", "不脩边幅", "修饰边幅", "兼官重绂", "名实相符",
    "尺竹伍符", "尺籍伍符", "火龙黼黻", "表里相符", "言行不符", "言行相符", "贩夫走卒", "连篇累幅", "连篇絫幅", "邯郸匍匐",
    "都俞吁咈", "鼎玉龟符", "余膏剩馥", "兰熏桂馥", "兰薰桂馥", "名实相副", "名实难副", "名高难副", "头会箕赋", "山殽野湋",
    "悉帅敝赋", "悉索敝赋", "悉索薄赋", "无衣之赋", "横征暴赋", "残膏剩馥", "民安物阜", "民康物阜", "民殷财阜", "民熙物阜",
    "涸辙之鲋", "物殷俗阜", "琴歌酒赋", "登高必赋", "登高能赋", "盛名难副", "繁刑重赋", "言行相副", "轻傜薄赋", "轻徭薄赋",
    "轻繇薄赋", "遗芬剩馥", "量金买赋", "率尔操觚", "余勇可贾", "南贩北贾", "多财善贾", "多钱善贾", "滔滔汩汩", "不尴不尬",
    "不猧不魀", "不间不界", "半间不界", "半间半界", "言简意该", "言简意赅", "语简意赅", "辞简义赅", "九儒十丐", "斗酒双柑",
    "步斗踏罡", "养音九皋", "鹤鸣九皋", "典谟训诰", "云窗雾阁", "亭台楼阁", "仙山楼阁", "仙山琼阁", "恫疑虚猲", "披沥肝膈",
    "束之高阁", "束在高阁", "束置高阁", "楼台亭阁", "殿堂楼阁", "空中楼阁", "置之高阁", "置诸高阁", "莺闺燕阁", "雕蚶镂蛤",
    "香闺绣阁", "龙楼凤阁", "买牛息戈", "倒戢干戈", "倒持干戈", "倒置干戈", "倒载干戈", "偃武息戈", "偃革倒戈", "入室操戈",
    "前徒倒戈", "卷甲韬戈", "同室操戈", "大动干戈", "寝苫枕戈", "弃甲倒戈", "弃甲投戈", "投袂援戈", "投袂荷戈", "挥日阳戈",
    "擐甲挥戈", "櫜弓戢戈", "泣血枕戈", "衽革枕戈", "被甲枕戈", "解甲倒戈", "解甲投戈", "铁马金戈", "铸甲销戈", "鲁阳挥戈",
    "鲁阳麾戈", "口谐辞给", "救过不给", "头痒搔跟", "祝僯祝鲠", "祝咽祝哽", "食古如鲠", "心膂股肱", "情重姜肱", "耳目股肱",
    "饮水曲肱", "截发剉穢", "向壁虚构", "肯堂肯构", "英雄入彀", "鸿图华构", "剑首一吷", "骈首就僯", "人民城郭", "等米下锅",
    "千刀万剐", "倾筐倒庋", "呼庚呼癸", "日不移晷", "日无暇晷", "旷日积晷", "焚膏继晷", "闭门扫迹", "收刀检卦", "问天买卦",
    "司空见惯", "大动公惯", "以噎废飡", "东游西逛", "石室金匮", "石室金鐀", "綦溪利跂", "翻箱倒柜", "玉箫金琯", "秦楼楚馆",
    "青楼楚馆", "夹枪带棍", "油头光棍", "假途灭虢", "假道灭虢", "槁项黧馘", "不亦乐乎", "出乎反乎", "心神恍惚", "心绪恍惚",
    "满不在乎", "神思恍惚", "神情恍惚", "精神恍惚", "者也之乎", "迷离恍惚", "不哼不哈", "四体百骸", "四肢百骸", "土木形骸",
    "放浪形骸", "放荡形骸", "易子析骸", "相忘形骸", "引以为憾", "操觚染翰", "虎头燕颔", "飞文染翰", "龙威燕颔", "捣虚批吭",
    "鬼哭狼嗥", "五虚六耗", "杳无音耗", "卖李钻核", "简约详核", "辩才无阂", "一丘一壑", "一丘之貉", "一邱之貉", "不忘沟壑",
    "以邻为壑", "千山万壑", "千岩万壑", "千峰万壑", "千沟万壑", "如水赴壑", "放情丘壑", "昂霄耸壑", "梯山架壑", "燕雀相贺",
    "经丘寻壑", "胸有丘壑", "胸有邱壑", "转死沟壑", "刮垢磨痕", "春梦无痕", "以忍为阍", "宴尔新婚", "指腹为婚", "燕尔新婚",
    "男大当婚", "男大须婚", "撮科打閧", "吹唇唱吼", "河东狮吼", "龙鸣狮吼", "如饮醍醐", "渴尘万斛", "源泉万斛", "狐埋狐搰",
    "专横跋扈", "千金一瓠", "屈谷巨瓠", "承天之祜", "渊涓蠖瀋", "豪横跋扈", "飞扬跋扈", "成群打伙", "成群结伙", "揣奸把猾",
    "深奸巨猾", "神奸巨猾", "老奸巨猾", "齿牙为猾", "齿牙之猾", "惨绝人寰", "游戏尘寰", "雨鬓风鬟", "雪鬓霜鬟", "雾鬓云鬟",
    "雾鬓风鬟", "侜张为幻", "千呼万唤", "山肤水豢", "罪不可逭", "美轮美奂", "诪张为幻", "谈空说幻", "风云变幻", "对牛鼓簧",
    "巧舌如簧", "巧言如簧", "景星凤凰", "栖栖遑遑", "正大堂煌", "灯火辉煌", "灯烛辉煌", "灿烂辉煌", "谦让未遑", "金璧辉煌",
    "金碧荧煌", "金碧辉煌", "鼓舌掀簧", "泉石膏肓", "深入膏肓", "病入膏肓", "病在膏肓", "病染膏肓", "德胜头迴", "不露锋铓",
    "奇花异卉", "渊渟泽汇", "鶗鴂雕卉", "奇葩异卉", "湛恩汪濊", "发科打诨", "坠茵落溷", "插科打诨", "撒科打诨", "飘樊落溷",
    "飘籵坠溷", "飘茵堕溷", "飘茵落溷", "飘茵随溷", "弥天大谎", "漫天大谎", "瞒天大谎", "迷天大谎", "刀锯鼎镬", "斧钺汤镬",
    "不拘形迹", "倜傥不羁", "卓荦不羁", "反唇相讥", "口吐珠玑", "名胜古迹", "哼哼唧唧", "字字珠玑", "忧谗畏讥", "放浪不羁",
    "放浪无羁", "放纵不羁", "放荡不羁", "放诞不羁", "放达不羁", "旷达不羁", "杳无踪迹", "游荡不羁", "满腹珠玑", "碎玉零玑",
    "磊浪不羁", "磊瑰不羁", "磊落不羁", "自郐无讥", "落拓不羁", "落魄不羁", "藏踪蹑迹", "豪放不羁", "负俗之讥", "跅幪不羁",
    "跅弛不羁", "跅弢不羁", "跌宕不羁", "跌荡不羁", "郐下无讥", "霸王别姬", "憨状可掬", "玉佩琼琚", "笑容可掬", "严于律已",
    "人足家给", "日不暇给", "目不暇给", "飞檐走脊", "饔飧不给", "临难不惧", "勿忘在莒", "咸阳一炬", "心低意沮", "魂慑色沮",
    "魂慴色沮", "一班一级", "一资半级", "一阶半级", "中流击楫", "人言籍籍", "博通经籍", "杯盘狼籍", "枕戈击楫", "盐梅舟楫",
    "纷纷籍籍", "赃污狼籍", "赃私狼籍", "赃贿狼籍", "蹿房越脊", "兽迒鸟迹", "含明隐迹", "埋声晦迹", "外宽内忌", "寸长尺技",
    "寻踪觅迹", "屠龙之伎", "屠龙之技", "彫虫小技", "心有余悸", "恣睢无忌", "恣肆无忌", "投鼠之忌", "敛声匿迹", "无所畏忌",
    "无所顾忌", "昌言无忌", "望尘追迹", "杜门屏迹", "杜门晦迹", "杜门绝迹", "来踪去迹", "杳无人迹", "梧鼠之技", "梧鼠五技",
    "横行无忌", "橐驼之技", "比肩叠迹", "比肩接迹", "比肩迭迹", "流风遗迹", "浮踪浪迹", "消声匿迹", "消声灭迹", "渺无人迹",
    "潜形匿迹", "潜形谲迹", "潜踪蹑迹", "潜踪隐迹", "片长末技", "片长薄技", "甘之如荠", "甘心如荠", "畏影恶迹", "畏影避迹",
    "百无禁忌", "神乎其技", "窜端匿迹", "肆行无忌", "萍踪浪迹", "蛛丝马迹", "车尘马迹", "车辙马迹", "过江之鲫", "遁名匿迹",
    "遁身远迹", "避影敛迹", "重足一迹", "销声匿迹", "销声敛迹", "雕虫小技", "雕虫末伎", "雕虫末技", "雕虫薄技", "雨踪云迹",
    "雪泥鸿迹", "韬光敛迹", "韬光晦迹", "韬光灭迹", "韬光隐迹", "韬声匿迹", "韬神晦迹", "飘萍浪迹", "驾肩接迹", "骈肩叠迹",
    "骈肩接迹", "骈肩累迹", "骈肩迭迹", "鸥波萍迹", "黔驴之技", "龟文鸟迹", "话里藏阄", "富商大贾", "富商巨贾", "富商蓄贾",
    "豪商巨贾", "飞觞走斝", "飞觥献斝", "飞觥走斝", "鸿商富贾", "冯生弹铗", "冯髈弹铗", "龙骧虎踤", "寸蹄尺缣", "尺幅寸缣",
    "雁素鱼笺", "以慎为键", "毛遂自荐", "祁奚之荐", "餐松饮涧", "万世无疆", "万寿无疆", "万年无疆", "信马由缰", "列土封疆",
    "利锁名缰", "极寿无疆", "此界彼疆", "画土分疆", "画野分疆", "福寿无疆", "野马无缰", "加油添酱", "目瞪舌彊", "覆鹿寻蕉",
    "冰天雪窑", "冰天雪窖", "文君新醮", "仰人眉睫", "吹毛数睫", "地灵人杰", "女中豪杰", "巾帼豪杰", "材茂行絜", "渊清玉絜",
    "目不交睫", "目不见睫", "看人眉睫", "祸迫眉睫", "绿林豪杰", "英雄豪杰", "近在眉睫", "迫于眉睫", "迫在眉睫", "鹪巢蚊睫",
    "俛拾地芥", "俯拾地芥", "大千世界", "大开眼界", "如拾地芥", "如泣草芥", "小惩大诫", "常鳞凡介", "开阔眼界", "引针拾芥",
    "放眼世界", "断织之诫", "无远不届", "无远弗届", "易如拾芥", "极乐世界", "此疆尔界", "河沙世界", "清平世界", "看杀卫玠",
    "花花世界", "花锦世界", "虎珀拾芥", "视如土芥", "视如草芥", "谆谆告诫", "谆谆诰诫", "黄金世界", "百舍重趼", "逾闲荡检",
    "门不夜扃", "孤舟独桨", "一干二净", "不干不净", "亲临其境", "六根清净", "冬温夏凊", "学无止境", "开疆拓境", "恍如梦境",
    "手脚干净", "无人之境", "永无止境", "渐入佳境", "渐至佳境", "漫无止境", "窗明几净", "耳根清净", "衣冠枭獍", "身临其境",
    "身历其境", "身当其境", "风轻云净", "鼪鼬之迳", "佣中佼佼", "庸中佼佼", "铮铮佼佼", "弹冠振衿", "力敌势均", "夏虫朝菌",
    "苦乐不均", "握瑜怀瑾", "张眼露睛", "火眼金睛", "画龙点睛", "目不转睛", "金刚眼睛", "鼓眼努睛", "伸头缩颈", "兵在其颈",
    "燕颔虎颈", "缩头缩颈", "造谋布阱", "鸢肩鹄颈", "龙眉豹颈", "临事而惧", "临危不惧", "付之一炬", "付诸一炬", "剸繁决剧",
    "剸繁治剧", "勇者不惧", "季常之惧", "无所畏惧", "栗栗危惧", "甄心动惧", "目光如炬", "日削月朘", "日削月杒", "望帝啼鹃",
    "丹楹刻桷", "买官鬻爵", "加官晋爵", "加官进爵", "卖官卖爵", "卖官贩爵", "卖官鬻爵", "可发一噱", "析圭儋爵", "析圭担爵",
    "艰难竭蹶", "计功受爵", "贩官鬻爵", "高官尊爵", "高官显爵", "狼艰狈蹶", "连州跨郡", "孜孜砽砽", "孳孳砽砽", "狡兔三窟",
    "龙潭虎窟", "同仇敌忾", "同心敌忾", "敌王所忾", "今蝉蜕壳", "榆木脑壳", "一枕南柯", "操斧伐柯", "梦里南轲", "混混泇泇",
    "勤勤恳恳", "不声不吭", "拊背扼吭", "拊背搤吭", "攻心扼吭", "蝇头小楷", "一掷乾坤", "函盖乾坤", "壶里乾坤", "扭转乾坤",
    "扭转干坤", "整顿干坤", "旋乾转坤", "旋干转坤", "旋转乾坤", "旋转干坤", "朗朗乾坤", "花下晒裈", "花下晒裻", "颠乾倒坤",
    "颠倒乾坤", "颠倒干坤", "掤扒吊拷", "绷巴吊拷", "绷扒吊拷", "绷爬吊拷", "山木自寇", "悬猙素飡", "成王败寇", "落草为寇",
    "负乘致寇", "赍粮藉寇", "刀枪入库", "坏裳为裤", "膏梁纨袴", "膏梁纨裦", "膏粱纨裦", "弃甲丢盔", "三窝两块", "寝苫枕块",
    "席薪枕块", "成团打块", "累苏积块", "胸中垒块", "膏场绣浍", "藉草枕块", "过都历块", "铁板一块", "韩卢逐块", "寝关曝纩",
    "条条框框", "每下愈况", "热泪盈眶", "万目睽睽", "众目睽睽", "为山止篑", "九仞一篑", "功亏一篑", "十室九匮", "发聋振聩",
    "发蒙振聩", "周穷恤匮", "器二不匮", "孝思不匮", "山亏一篑", "振聋发聩", "昭聋发聩", "未成一篑", "民穷财匮", "消愁释愦",
    "石缄金匮", "磨昬抉聩", "计绌方匮", "震聋发聩", "青龙金匮", "批郤导窾", "批鄐导竨", "质而不俚", "不绝如缕", "分丝析缕",
    "千丝万缕", "千条万缕", "命俦啸侣", "指不胜偻", "燕俦莺侣", "狂朋怪侣", "痛贯心膂", "筚路蓝缕", "筚路褴褛", "细针密缕",
    "莺俦燕侣", "衣衫蓝缕", "衣衫褴褛", "诗朋酒侣", "身无寸缕", "间不容缕", "雕肝琢膂", "鸳俦凤侣", "鸾俦凤侣", "鸿俦鹤侣",
    "鹭朋鸥侣", "东风入律", "五音六律", "出出律律", "千古一律", "千年一律", "千篇一律", "半丝半缕", "同音共律", "抱令守律",
    "方头不律", "析言破律", "清规戒律", "视同一律", "金科玉律", "吱哩哇啦", "东挦西撦", "兴如嚼蜡", "吹灯拔蜡", "味如嚼蜡",
    "心狠手辣", "抟沙嚼蜡", "甜酸苦辣", "酸咸苦辣", "酸甜苦辣", "奴颜婢睐", "明眸善睐", "认奴作郞", "认奴作鄌", "味如鸡肋",
    "沅江九肋", "铜筋铁肋", "不失黍絫", "四郊多垒", "森严壁垒", "深壁固垒", "深沟固垒", "深沟壁垒", "深沟高垒", "莺巢燕垒",
    "瘦骨梭棱", "不失毫厘", "不差毫厘", "且食蛤蜊", "兴会淋漓", "兴致淋漓", "分毫析厘", "发屋求狸", "哺糟啜醨", "哺糟歠醨",
    "慷慨淋漓", "施衿结褵", "析毫剖厘", "痛快淋漓", "穷鼠啮狸", "简落狐狸", "酣嬉淋漓", "酣畅淋漓", "酣痛淋漓", "餵糟啜漓",
    "餵糟啜醨", "餵糟歠漓", "餵糟歠醨", "鲜血淋漓", "一行作吏", "严家饿隶", "乘车戴笠", "凤鸣鹤唳", "刻木为吏", "削木为吏",
    "华亭鹤唳", "山节藻棁", "弃琼拾砾", "晴天霹雳", "滥官污吏", "澄沙汰砾", "烟蓑雨笠", "猿啼鹤唳", "粒米狼戾", "绿蓑青笠",
    "老骥伏枥", "自取咎戾", "自取罪戾", "芒鞋竹笠", "荣谐伉俪", "贩夫皁隶", "贩夫皂隶", "贪官污吏", "赃官污吏", "镂冰炊砾",
    "门生故吏", "雨蓑烟笠", "雨蓑风笠", "青天霹雳", "风声鹤唳", "飞沙扬砾", "飞沙走砾", "飞砂扬砾", "鸷狠狼戾", "涕泗流涟",
    "一枕黄粱", "世态炎凉", "满目凄凉", "纨裦膏粱", "踽踽凉凉", "辨日炎凉", "匹夫之谅", "匹夫小谅", "心明眼亮", "明光烁亮",
    "明光铮亮", "明光锃亮", "油光晶亮", "眼明心亮", "矜纠收缭", "大大咧咧", "焚林而猎", "钉头磷磷", "傲骨嶙嶙", "沛雨甘霖",
    "波光粼粼", "瘦骨嶙嶙", "久怀慕蔺", "出内之吝", "出纳之吝", "改过不吝", "有三有俩", "鬼蜮伎俩", "鬼蜮技俩", "鬼魅伎俩",
    "魑魅魍魉", "塞耳偷铃", "屋上建瓴", "掩耳偷铃", "掩耳盗铃", "破竹建瓴", "解铃系铃", "高屋建瓴", "龟鹤遐龄", "幺豚暮鹨",
    "偎慵堕懒", "帮闲钻懒", "心慵意懒", "心灰意懒", "炳炳焤焤", "丛山峻岭", "崇山峻岭", "巴山度岭", "巴山越岭", "横峰侧岭",
    "沓冈复岭", "登山越岭", "登山陟岭", "翻山越岭", "遝冈复岭", "重山复岭", "重山峻岭", "高山峻岭", "悬剑空垄", "扑杀此獠",
    "七窍玲珑", "八窗玲珑", "八面玲珑", "剔透玲珑", "娇小玲珑", "小巧玲珑", "依样葫芦", "打闷葫芦", "出手得卢", "掩口胡卢",
    "掩口葫芦", "方足圆颅", "方趾圆颅", "黄公酒垆", "兼收并录", "功名利禄", "加官进禄", "招权纳赂", "无任之禄", "无功受禄",
    "无功而禄", "有闻必录", "死有余僯", "膺图受箓", "贪位慕禄", "饥肠辘辘", "高位厚禄", "高位重禄", "高官厚禄", "高官重禄",
    "高爵厚禄", "高爵重禄", "勺水一脔", "叠嶂层峦", "尝鼎一脔", "禁鼎一脔", "迭嶂层峦", "儗不于伦", "儗非其伦", "卓荦超伦",
    "拟于不伦", "拟非其伦", "无与比伦", "无可比伦", "旷古绝伦", "精妙绝伦", "精美绝伦", "绝世超伦", "荒谬绝伦", "语妙绝伦",
    "负类反伦", "超世绝伦", "超然迈伦", "超类绝伦", "超群绝伦", "超迈绝伦", "越次超伦", "逸群绝伦", "逸辈殊伦", "颖悟绝伦",
    "吹大法螺", "大吹法螺", "渭川千亩", "骊黄牝牡", "井底虾蟆", "井底蛤蟆", "婆婆妈妈", "天真烂熳", "毁瓦画墁", "旧念复萌",
    "亡戟得矛", "倒持戈矛", "前跋后痜", "杯酒戈矛", "好戴高帽", "雨巾风帽", "改换门楣", "一笑百媚", "倚姣作媚", "千娇百媚",
    "夙兴夜寐", "夜不成寐", "寝不成寐", "寝不聊寐", "恍如梦寐", "敛怨求媚", "明发不寐", "春光明媚", "晨兴夜寐", "柳娇花媚",
    "桃夭柳媚", "百鬼众魅", "花明柳媚", "逞娇斗媚", "阿谀谄媚", "东央西浼", "避之若浼", "搏牛之虻", "故态复萌", "旧态复萌",
    "杜渐防萌", "比屋连甍", "画栋飞甍", "见微知萌", "遏渐防萌", "鄙吝复萌", "防患未萌", "防芽遏萌", "不迁之庙", "南州冠冕",
    "堂皇冠冕", "柳昏花螟", "风雨晦暝", "争分夺秒", "虚无缥缈", "童心未泯", "吕武操莽", "铜驼草莽", "子丑寅卯", "应名点卯",
    "毂交蹄劘", "不甘寂寞", "关心民瘼", "呴湿濡沫", "相濡以沫", "赍志以殁", "赍志而殁", "渔夺侵牟", "皓齿明眸", "上和下睦",
    "讲信修睦", "风光旖旎", "千补百衲", "娉婷婀娜", "拘挛补衲", "计出无奈", "事出无奈", "出于无奈", "无如之奈", "无计可奈",
    "无计所奈", "调和鼎鼐", "无理取闹", "若敖鬼馁", "不可端倪", "不知端倪", "乾端坤倪", "大旱云霓", "尺泽之鲵", "干端坤倪",
    "雨膏烟腻", "鱼瞵鹗睨", "重生爷娘", "金屋娇娘", "养虎自齧", "兽穷则齧", "奉为圭臬", "玉圭金臬", "金科玉臬", "出舆入辇",
    "三期贤佞", "亲贤远佞", "祝鮠之佞", "进贤退佞", "进贤黜佞", "嘟嘟哝哝", "寓兵于农", "谷贱伤农", "刀耕火耨", "深耕易耨",
    "火耕水耨", "凤凰在笯", "罪人不孥", "七担八挪", "东闪西挪", "娉婷袅娜", "袅袅娜娜", "无偏无颇", "无平不颇", "财殚力痡",
    "嗜痂之癖", "季常之癖", "断袖之癖", "盘龙之癖", "巫山洛浦", "樵村渔浦", "珠还合浦", "还珠合浦", "倒打一耙", "别抱琵琶",
    "铁板铜琶", "铁绰铜琶", "丽藻春葩", "瑶草琪葩", "百卉千葩", "同源异派", "十二金牌", "挂印悬牌", "行香挂牌", "金字招牌",
    "心潮澎湃", "拉帮结派", "汹涌澎湃", "凤翥龙蟠", "凤舞龙蟠", "心宽体胖", "心广体胖", "虎据龙蟠", "虎踞龙蟠", "亲离众叛",
    "左顾右盼", "招亡纳叛", "招降纳叛", "解衣槃磅", "解衣盘磅", "倒冠落珮", "凤冠霞帔", "截辕杜辔", "诡衔窃辔", "轻裘缓辔",
    "金镳玉辔", "霞裙月帔", "齐轨连辔", "大雨倾盆", "蚍蜉戴盆", "见风转篷", "趁势落篷", "凄入肝脾", "感人心脾", "沁人心脾",
    "沁入心脾", "痛入心脾", "六通四辟", "天开地辟", "能近取譬", "鸿蒙初辟", "下笔成篇", "废话连篇", "斗酒百篇", "空话连篇",
    "累牍连篇", "鬼话连篇", "东诓西骗", "坑绷拐骗", "坑蒙拐骗", "招摇撞骗", "潜窃阳剽", "空头支票", "一笑一颦", "东家效颦",
    "东施效颦", "伺瑕导蠙", "伺瑕抵蠙", "逾墙窥蠙", "逾墙钻蠙", "驷之过蠙", "席珍待聘", "男婚女聘", "鸣野食苹", "孤苦仃俜",
    "束蒲为脯", "为国捐躯", "碎身糜躯", "碎首糜躯", "碎首縻躯", "粉骨捐躯", "粉骨糜躯", "陟岵陟屺", "停妻再娶", "明婚正娶",
    "明媒正娶", "男大当娶", "一路神祇", "凤臆龙鬵", "煮豆燃萁", "归正首邱", "羹藜含糗", "羹藜唅糗", "三风十愆", "命薄缘悭",
    "好事多悭", "好事天悭", "惹祸招愆", "郁郁芊芊", "闭门思愆", "三好两歉", "为好成歉", "以丰补歉", "嫌好道歉", "左铅右椠",
    "怀觚握椠", "怀铅提椠", "怀铅握椠", "握铅抱椠", "阵马风樯", "野调无腔", "踉踉跄跄", "过桥拆桥", "过河拆桥", "遇水叠桥",
    "遇水架桥", "遇水迭桥", "三魂出窍", "痰迷心窍", "财迷心窍", "金蝉脱壳", "鬼迷心窍", "三妻四妾", "倾筐倒箧", "倾箱倒箧",
    "探囊胠箧", "河东三箧", "翻箱倒箧", "曝背食芹", "野人献芹", "补阙灯檠", "洞中肯綮", "深中肯綮", "君子好逑", "招权纳赇",
    "贫病交侵", "倒廪倾囷", "韩卢逐逡", "食鱼遇鲭", "一弹指顷", "一碧万顷", "匹妇沟渠", "扫穴擒渠", "柳陌花衢", "血流成渠",
    "转死沟渠", "高步云衢", "高步通衢", "东张西觑", "个中妙趣", "别有风趣", "大煞风趣", "打情骂趣", "标情夺趣", "涉笔成趣",
    "目目相觑", "相映成趣", "自讨没趣", "逢场作趣", "闲情逸趣", "面面厮觑", "面面相觑", "饶有风趣", "鳌掷鲸呿", "得鱼忘筌",
    "得鱼忘荃", "进道若蜷", "进道若踡", "为恶不悛", "怙恶不悛", "怙终不悛", "怙过不悛", "怙顽不悛", "稔恶不悛", "讳恶不悛",
    "造恶不悛", "长恶不悛", "长恶靡悛", "丹书铁券", "可操左券", "如持左券", "如操左券", "必操胜券", "稳操左券", "稳操胜券",
    "渊鱼丛爵", "鹤骨霜髯", "分外妖娆", "守正不桡", "询于刍荛", "云程发轫", "壁立千仞", "外厉内荏", "色厉内荏", "光阴荏苒",
    "偏乡僻壤", "叩石垦壤", "熙熙壤壤", "穷乡僻壤", "穷山僻壤", "穷泉朽壤", "腼颜天壤", "貊乡鼠壤", "遐州僻壤", "遐方绝壤",
    "鼓腹击壤", "庸人自扰", "江翻海扰", "纷纷扰扰", "自相惊扰", "出水芙蓉", "初发芙蓉", "头角峥嵘", "岁月峥嵘", "并蒂芙蓉",
    "狐裘尨茸", "狐裘蒙茸", "远山芙蓉", "众说纷揉", "心痒难揉", "玉石杂糅", "玉石相揉", "瓦玉集糅", "造作矫揉", "以沫相濡",
    "嗫嗫嚅嚅", "目染耳濡", "趑趄嗫嚅", "缠绵床褥", "吹叶嚼蕊", "吹花嚼蕊", "浮花浪蕊", "蟹匡蝉緌", "黄杨厄闰", "人喊马嘶",
    "人语马嘶", "力竭声嘶", "气竭声嘶", "气竭声澌", "枝叶扶苏", "滴粉搓酥", "累块积苏", "钻冰求酥", "骨软筋酥", "骨软肉酥",
    "洋洋纚纚", "一笔抹摋", "唇不离腮", "尖嘴猴腮", "扒耳搔腮", "抓耳挠腮", "抓耳搔腮", "拙口笨腮", "拙口钝腮", "拙嘴笨腮",
    "撧耳挠腮", "撧耳揉腮", "杏脸桃腮", "爬耳搔腮", "莺吟燕儛", "钝口拙腮", "顿口拙腮", "不稼不穑", "服田力穑", "村酒野蔬",
    "桑户桊枢", "桑户棬枢", "桑户蓬枢", "瓮牖桑枢", "瓮牖绳枢", "饭粝茹蔬", "韶华如驶", "流离颠痜", "象简乌纱", "一时半霎",
    "高堂大厦", "高楼大厦", "雨淋日晒", "风吹日晒", "糠豆不赡", "一品白衫", "司马青衫", "如蚁慕膻", "如蚁附膻", "步履蹒跚",
    "白发青衫", "白帢青衫", "白袷蓝衫", "群蚁附膻", "魂飞魄飏", "救过不赡", "词华典赡", "问安视膳", "问寝视膳", "水佩风裳",
    "颠衣到裳", "鸿衣羽裳", "作嫁衣裳", "无服之殇", "不胜杯杓", "不胜梘杓", "采兰赠芍", "喜上眉梢", "喜溢眉梢", "连根带梢",
    "年高德劭", "旁搜远绍", "旁蒷远绍", "花里胡哨", "岁在龙蚮", "附赘悬胾", "临难无慑", "土豪劣绅", "熊据虎踤", "刳心雕肾",
    "刿心鉥肾", "刿鉥肝肾", "彫肝琢肾", "鉥心刿肾", "鉥肝刿肾", "镂肝鉥肾", "镌脾琢肾", "雕心刻肾", "雕肝掐肾", "雕肝琢肾",
    "雕肝镂肾", "不值一哂", "断管残渖", "自我牺牲", "想望风褱", "朝成暮徧", "鼠啮蠹蚀", "鼠齧蠹蚀", "假门假氏", "及锋而试",
    "发硎新试", "山陬海澨", "悬车致仕", "新硎初试", "日省月试", "牛刀小试", "跃跃欲试", "金相玉式", "长材小试", "一时半晌",
    "货而不售", "一献三售", "弹冠结绶", "衒玉求售", "衒玉自售", "酒酸不售", "金印紫绶", "金章紫绶", "百身何赎", "百身莫赎",
    "不学无术", "仁心仁术", "分身无术", "回天乏术", "回春之术", "坏人心术", "弃道任术", "教亦多术", "点金乏术", "点金无术",
    "计然之术", "驻颜有术", "剔抽禿刷", "破罐破摔", "胡打海摔", "呷醋节帅", "苛捐杂税", "衣租食税", "轻徭薄税", "食租衣税",
    "东西南朔", "迷离扑朔", "五车腹笥", "狼羊同饲", "覆宗灭祀", "配享从汜", "握发吐飧", "朝饔夕飧", "收旗卷伞", "雨后送伞",
    "雨后春笋", "早韭晚菘", "睡眼惺忪", "一推两搡", "挠喉捩嗓", "泣血稽颡", "兴词构讼", "包揽词讼", "家传人诵", "家传户诵",
    "家弦户诵", "昼耕夜诵", "涂歌邑诵", "耳闻则诵", "触目成诵", "计过自讼", "调词架讼", "过目成诵", "马勃牛溲", "马浡牛溲",
    "黄干黑廲", "黄皮刮廲", "黄皮寡廲", "精神抖擞", "黄童白叟", "如泣如诉", "山肴野蔌", "折足覆餸", "折鼎覆餸", "木雕泥塑",
    "楚楚谡谡", "肤受之诉", "鼎折覆餸", "暴戾恣睢", "跋扈恣睢", "雨笠烟蓑", "伐毛换髓", "伐毛洗髓", "剥肤及髓", "剥肤椎髓",
    "怨入骨髓", "恨入骨髓", "戳心灌髓", "捶骨沥髓", "敲膏吸髓", "敲骨剥髓", "敲骨取髓", "敲骨吸髓", "敲骨榨髓", "椎肤剥髓",
    "沦浃肌髓", "沦肌浃髓", "浃沦肌髓", "深入骨髓", "深刺腧髓", "病入骨雜", "病入骨髓", "痛入骨髓", "麟肝凤髓", "龙肝凤髓",
    "龙血凤髓", "一牛九锁", "云迷雾锁", "利缰名锁", "名缰利锁", "披枷带锁", "披枷戴锁", "重垣叠锁", "重垣迭锁", "金枷玉锁",
    "钻头就锁", "凿骨捣髓", "邪魔外祟", "鬼鬼祟祟", "之死靡它", "天崩地塌", "天摧地塌", "山崩地塌", "至死靡它", "人情世态",
    "千姿万态", "千状万态", "柔情绰态", "高情逸态", "孽根祸胎", "心怀鬼胎", "怀着鬼胎", "换骨夺胎", "换骨脱胎", "浊骨凡胎",
    "老蚌珠胎", "肉眼凡胎", "龙肝豹胎", "一反常态", "千姿百态", "姱容修态", "忸怩作态", "惺惺作态", "柔情媚态", "柳腰花态",
    "楚楚作态", "炎凉世态", "狂奴故态", "装腔作态", "风云变态", "鸾姿凤态", "入阁登坛", "虎穴龙潭", "虎窟龙潭", "天崩地坍",
    "积沙成滩", "万民涂炭", "坐于涂炭", "枘凿冰炭", "民生涂炭", "漆身吞炭", "生民涂炭", "生灵涂炭", "苍生涂炭", "雪中送炭",
    "雪里送炭", "黎庶涂炭", "批砉导竨", "惊风怒涛", "骇浪惊涛", "不落俗套", "成龙配套", "插圈弄套", "整本大套", "生搬硬套",
    "长篇大套", "陈言老套", "负罪引慝", "牵丝攀藤", "枯杨生稊", "入孝出悌", "日乾夕惕", "昼乾夕惕", "昼干夕惕", "昼警夕惕",
    "朝乾夕惕", "朝前夕惕", "神竦心惕", "魂惊魄惕", "焚林而畋", "语笑喧阗", "车马骈阗", "金鼓喧阗", "马咽车阗", "鼓吹喧阗",
    "以规为瑱", "万里迢迢", "千里迢迢", "路远迢迢", "黄发垂髫", "极目远眺", "唐临晋帖", "服服贴贴", "鱼封雁帖", "杀人如蓺",
    "诲人不惓", "鱼书雁帖", "初写黄庭", "发言盈庭", "大发雷霆", "大有径庭", "大有迳庭", "大相径庭", "大相迳庭", "岳峙渊渟",
    "扫穴犁庭", "改换门庭", "日角珠庭", "日角龙庭", "袅娜娉婷", "袅袅婷婷", "鸾鹄在庭", "黍秀宫庭", "岳镇渊渟", "往渚还汀",
    "五尺之僮", "庸中皦皦", "日中必湲", "有眼无瞳", "博硕肥腯", "就棍打腿", "稚齿婑媠", "大雨滂沱", "委委佗佗", "岁月蹉跎",
    "日月蹉跎", "涕泗滂沱", "涕泗滂沲", "秤不离砣", "荆棘铜驼", "抱关击柝", "沉烽静柝", "重关击柝", "重门击柝", "百二金瓯",
    "雪碗冰瓯", "齐大非耦", "腾腾兀兀", "与物无忤", "京兆眉妩", "内忧外侮", "启宠纳侮", "折冲御侮", "猫噬鹦鹉", "砥兵砺伍",
    "祁奚举午", "羞与为伍", "羞与哙伍", "耻与哙伍", "阋墙御侮", "青鞋布袜", "壮士断腕", "壮士解腕", "瞋目扼腕", "人丁兴旺",
    "六畜兴旺", "神来气旺", "繁荣兴旺", "不伤脾胃", "刮肠洗胃", "官官相卫", "引狼自卫", "引虎自卫", "搜索肾胃", "摸金校尉",
    "放虎自卫", "洗肠涤胃", "炊粱跨卫", "破肝糜胃", "长鸣都尉", "霸陵醉尉", "饮灰洗胃", "首尾相卫", "不辨真伪", "互相推诿",
    "冒大不韪", "化性起伪", "负芒披苇", "跗萼载韡", "黄茅白苇", "一丝不紊", "搜肠润吻", "有条不紊", "牛骥同皁", "豺狼之吻",
    "身寄虎吻", "鸱目虎吻", "失马塞翁", "饭囊酒畒", "螫手解腕", "鹿车共挽", "目眢心忳", "坐筹帷幄", "绸缪帷幄", "谋谟帷幄",
    "运策帷幄", "运筹帏幄", "运筹帷幄", "举要删芜", "一差二悮", "一闻千悟", "不敢旁骛", "刻鹄成鹜", "刻鹄类鹜", "大彻大悟",
    "大澈大悟", "家鸡野鹜", "幡然悔悟", "心无旁骛", "心领神悟", "恍然大悟", "憬然有悟", "执迷不悟", "横驱别骛", "沉迷不悟",
    "翻然悔悟", "至死不悟", "豁然大悟", "豁然开悟", "豁然省悟", "豁然顿悟", "趋之若骛", "趋之若鹜", "遂迷不竝", "陶陶兀兀",
    "乘险抵巇", "今不如昔", "妇姑勃溪", "妇姑勃谿", "妇姑勃豨", "归去来兮", "感今怀昔", "感今思昔", "感今惟昔", "批亢抵巇",
    "投隙抵巇", "抚今思昔", "抚今悼昔", "抚今痛昔", "抚今追昔", "监市履猯", "行同狗豨", "裸裎袒裼", "一梦华胥", "井管拘墟",
    "华屋丘墟", "华屋秋墟", "如弃敝屣", "弃之敝屣", "弃如敝屣", "弃若敝屣", "恭贺新禧", "焚符破玺", "视如敝屣", "间不容瞚",
    "目成心许", "飞书走檄", "一傅众咻", "众楚群咻", "被泽蒙庥", "好整以暇", "应接不暇", "救过不暇", "敬事不暇", "牵衣投辖",
    "磨盾之暇", "自救不暇", "自顾不暇", "闭门投辖", "投隙抵罅", "情投意忺", "一针一线", "不绝如线", "不绝若线", "买田阳羡",
    "他乡异县", "伈伈睍睍", "单丝不线", "口含天宪", "口衔天宪", "啧啧称羡", "恪守成宪", "无丝有线", "日长一线", "横针竖线",
    "皂丝麻线", "神州赤县", "穿针引线", "草蛇灰线", "行针步线", "连州比县", "飞针走线", "鱼龙曼羡", "凤翥鸾翔", "凤翥鹏翔",
    "凤翥龙翔", "高飞远翔", "鹄峙鸾翔", "龙飞凤翔", "云起龙襄", "云起龙骧", "凤翥龙骧", "千仓万箱", "待月西厢", "积案盈箱",
    "肤受之愬", "虎超龙骧", "唯妙唯肖", "惟妙惟肖", "戎马劻勷", "维妙维肖", "亦庄亦谐", "凤友鸾谐", "鱼水和谐", "一些半些",
    "拔丁抽楔", "钟漏并歇", "坚持不懈", "夙夜匪懈", "始终不懈", "孜孜不懈", "层台累榭", "常备不懈", "敲冰玉屑", "明火执械",
    "楼阁台榭", "歌台舞榭", "歌楼舞榭", "神机鬼械", "竹头木屑", "谈霏玉屑", "鄙于不屑", "鄙夷不屑", "金题玉躞", "银河倒泻",
    "陷于缧绁", "餐霞漱瀣", "餐霞饮瀣", "轻描淡写", "草薙禽狝", "草藄禽猘", "人情恟恟", "劳师糜饷", "飞刍转饷", "新发于硎",
    "避面尹邢", "使心作倖", "使心用倖", "言多伤倖", "审曲面埶", "鼓舞欢忻", "年高德勋", "开国元勋", "计伐称勋", "七子八婿",
    "七男八婿", "三头两绪", "东床佳婿", "东床姣婿", "东床娇婿", "东床快婿", "两头三绪", "乘龙佳婿", "乘龙快婿", "井井有序",
    "井井有绪", "井然有序", "千头万序", "千头万绪", "千愁万绪", "千条万绪", "千端万绪", "孤学坠绪", "平铺直叙", "平铺直序",
    "无情无绪", "杂乱无序", "槁项黄馘", "离情别绪", "肩从齿序", "茫无头绪", "茫无端绪", "言之有序", "贯鱼之序", "遗声坠绪",
    "长幼有叙", "长幼有序", "永矢弗谖", "风和日暄", "剑头一吷", "昼警暮巡", "瘦骨嶙峋", "杳无音讯", "桀傲不驯", "桀敖不驯",
    "桀骜不驯", "桀骜难驯", "渺无音讯", "通风报讯", "五石六鹢", "气吞虹蝩", "万不得已", "不能自已", "丹铅甲乙", "丹黄甲乙",
    "低回不已", "叹观止矣", "墓木拱矣", "壮心不已", "大事去矣", "如此而已", "张甲李乙", "必不得已", "悔之晚矣", "情不自已",
    "情非得已", "探观止矣", "方兴未已", "无噍类矣", "有加无已", "有增无已", "死而后已", "毙而后已", "生生不已", "称赏不已",
    "至矣尽矣", "诛求不已", "诛求无已", "贪求无已", "赞叹不已", "越凫楚乙", "迫不得已", "逼不得已", "阅人多矣", "声振寰宇",
    "开疆拓宇", "望衡对宇", "琼楼玉宇", "紫芝眉宇", "草满囹圄", "轩昂气宇", "陷身囹圄", "雕墙峻宇", "咫尺天涯", "地角天涯",
    "学海无涯", "戎马生涯", "流落天涯", "浪迹天涯", "海角天涯", "陡壁悬崖", "风月无涯", "明效大验", "九垓八埏", "造谋布穽",
    "心不在焉", "轮焉奂焉", "风影敷衍", "屡试屡验", "旁求俊彦", "磨穿铁砚", "街谈巷谚", "贪惏无餍", "重明继焰", "飞蛾赴焰",
    "饥附饱飏", "乱点鸳鸯", "棒打鸳鸯", "死告活央", "长乐未央", "一式一样", "一模一样", "一模二样", "三般两样", "两般三样",
    "人模狗样", "像模像样", "别来无恙", "各式各样", "各色各样", "各色名样", "大模大样", "妆模作样", "安然无恙", "布帆无恙",
    "布颿无恙", "怪模怪样", "死模活样", "葫芦依样", "装模作样", "其道亡繇", "野蔌山肴", "风雨飘飖", "归邪转曜", "扣盘扪钥",
    "深扃固钥", "潜光匿曜", "盲翁扪钥", "汝成人耶", "抽抽噎噎", "祝哽祝噎", "祝鲠祝噎", "一狐之掖", "一狐之腋", "事生肘腋",
    "变生肘腋", "琼浆玉液", "琼浆金液", "瑶池玉液", "祸生肘腋", "金波玉液", "金浆玉液", "金精玉液", "雉头狐腋", "餐霞饮液",
    "之乎者也", "何其毒也", "溜之乎也", "空空如也", "莫予毒也", "莫余毒也", "千疮百痍", "满目疮痍", "翻黄倒皁", "骄奢淫泆",
    "一身两役", "以铢称镒", "息黥补劓", "投诸四裔", "救黥医劓", "无能为役", "束手就殪", "横征苛役", "痛心伤臆", "痛自创艾",
    "直抒胸臆", "祝鲠祝饐", "神采奕奕", "自怨自艾", "苦心孤诣", "通衢大邑", "通都大邑", "通都巨邑", "门庭赫奕", "饥饱劳役",
    "骄侈暴佚", "骄奢淫佚", "一望无垠", "侃侃訚訚", "批隙导竨", "无边无垠", "狼顾鸱踤", "心如刀剉", "魂牵梦萦", "侈丽闳衍",
    "披毛索靥", "披毛索黡", "重峦叠巘", "重峦迭巘", "鱼龙曼衍", "鱼龙漫衍", "春蛇秋蚓", "行行蛇蚓", "心烦技痒", "濯足濯缨",
    "遗簪绝缨", "决疣溃痈", "意懒心慵", "荆人涉澭", "不关痛痒", "不痛不痒", "不知疼痒", "不知痛痒", "不觉技痒", "怕痛怕痒",
    "无关痛痒", "栉垢爬痒", "知疼着痒", "虱多不痒", "隔靴抓痒", "隔靴搔痒", "隔靴爬痒", "优游涵泳", "波涛汹涌", "泪如泉涌",
    "燕跃鹄踊", "蜂起云涌", "雾兴云涌", "雾起云涌", "风起云涌", "风起水涌", "一熏一莸", "一薰一莸", "平原督邮", "附赘县疣",
    "附赘悬疣", "黼黻皇猷", "承天之佑", "承天之祐", "不稂不莠", "书画卯酉", "书通二酉", "参辰卯酉", "才贯二酉", "一针一缐",
    "丹青不渝", "之死不渝", "信守不渝", "出其不虞", "即鹿无虞", "参商之虞", "吁咈都俞", "坚守不渝", "坚持不渝", "坚贞不渝",
    "失之东隅", "始终不渝", "尔诈我虞", "心旷神愉", "忠贞不渝", "恪守不渝", "斗筲穿窬", "斗绝一隅", "暮虢朝虞", "枯骨之馀",
    "沂水舞雩", "没世不渝", "海角天隅", "灭虢取虞", "生死不渝", "白首不渝", "矢志不渝", "砥厉廉隅", "砥廉峻隅", "砥砺廉隅",
    "神怿气愉", "筚门圭窬", "终始不渝", "至死不渝", "苟安一隅", "衔橛之虞", "誓死不渝", "避溺山隅", "金石不渝", "不分畛域",
    "不药而愈", "不言而谕", "为鬼为蜮", "仰事俯育", "安于一隅", "广譬曲谕", "旁指曲谕", "殊方异域", "殊方绝域", "言之不预",
    "诎要桡膎", "遐方绝域", "阽危之域", "霍然而愈", "北辙南辕", "南棹北辕", "反面教员", "外方内员", "抱瓮灌园", "断井颓垣",
    "断壁残垣", "断壁颓垣", "春色满园", "目不窥园", "破瓦颓垣", "破觚为圜", "碎瓦颓垣", "败井颓垣", "钻穴逾垣", "雨井烟垣",
    "一厢情愿", "一相情愿", "三宫六院", "两相情愿", "向平之愿", "天从人愿", "天随人愿", "封官许愿", "心甘情愿", "桂林杏苑",
    "深宅大院", "甘心情愿", "自觉自愿", "负心违愿", "赌誓发愿", "蹈矩循彟", "不辟斧钺", "不避斧钺", "刀锯斧钺", "北门管钥",
    "北门锁钥", "扣槃扪籥", "抱关执籥", "抱关执钥", "白旄黄钺", "盲翁扪籥", "诗云子曰", "众口纷纭", "众说纷纭", "刀耕火耘",
    "聚讼纷纭", "议论纷纭", "象耕鸟耘", "寒耕暑耘", "寒耕热耘", "幺弦孤韵", "异口同韵", "林下风韵", "林籁泉韵", "流风余韵",
    "清音幽韵", "熏风解愠", "遗音余韵", "遗风余韵", "霞姿月韵", "风风韵韵", "高情远韵", "一尘不缁", "不磷不缁", "削发披缁",
    "剪发披缁", "山峙渊渟", "张唇植髭", "所费不赀", "涅而不淄", "涅而不缁", "驴唇马觜", "三舖八菹", "衣食税租", "恭敬桑梓",
    "敬恭桑梓", "泥而不滓", "泥蟠不滓", "珠沉玉磒", "以索续组", "传圭袭组", "析圭分组", "祝不胜诅", "进退触籵", "进退跋痜",
    "进退迍邅", "重圭叠组", "重珪叠组", "重珪迭组", "鸣玉曳组", "于呼哀哉", "优哉游哉", "何足道哉", "呜呼哀哉", "唐哉皇哉",
    "堂哉皇哉", "得其所哉", "悠哉游哉", "利令志惛", "口干舌燥", "另起炉灶", "唇干口燥", "唇焦口燥", "塞井夷灶", "执粗井灶",
    "扫锅刮灶", "添兵减灶", "清灰冷灶", "清锅冷灶", "炙冰使燥", "狐鸣枭噪", "生发未燥", "绳床瓦灶", "蛙鸣蝉噪", "重起炉灶",
    "以身作则", "有物有则", "汉人煮箦", "率由旧则", "指囷相赠", "绞尽脑汁", "金壶墨汁", "鱼目混珎", "丰墙峭址", "丰墙峭阯",
    "元经秘旨", "先意希旨", "先意承旨", "南橘北枳", "无关宏旨", "望风希旨", "望风承旨", "橘化为枳", "淮橘为枳", "潘文乐旨",
    "澧兰沅芷", "颓垣废址", "千叮万嘱", "惊心骇瞩", "犀照牛渚", "高瞻远瞩", "嘁嘁喳喳", "咄嗟叱咤", "喑噁叱咤", "狂轰滥炸",
    "引狗入寨", "偷营劫寨", "安营下寨", "安营扎寨", "广夏细旃", "寻瘢索绽", "皮开肉绽", "鹊巢鸠佔", "彝鼎圭璋", "断壁残璋",
    "乜斜缠帐", "云窗月帐", "千峰百嶂", "头昏脑胀", "层峦叠嶂", "层峦迭嶂", "秋后算账", "运筹帷帐", "重岩叠嶂", "重岩叠障",
    "重岩迭嶂", "重岩迭障", "重峦叠嶂", "重峦复嶂", "重峦迭嶂", "雨霾风障", "龙游曲沼", "云迷雾罩", "全璧归赵", "凭几之诏",
    "刘毅答诏", "原璧归赵", "围魏救赵", "完璧归赵", "张王李赵", "朝奏夕召", "玉楼赴召", "黄风雾罩", "离蔬释屩", "离蔬释躥",
    "钩辀格磔", "马毛猬磔", "马毛蝟磔", "低唱浅斟", "栉比鳞臻", "满目荆榛", "百福具臻", "连篇累帧", "金人之箴", "饥馑荐臻",
    "千变万轸", "连镳并轸", "含商咀徵", "含宫咀徵", "掎裳连襼", "断线风筝", "不治之症", "疑难杂症", "面折廷诤", "一官半职",
    "一文不值", "一钱不值", "一阶半职", "以身殉职", "克尽厥职", "冥行擿埴", "分文不值", "分毫不值", "各有所职", "寿不压职",
    "年该月值", "弟男子侄", "沿才受职", "洗手奉职", "近亲繁殖", "龙腾虎踯", "一挥九制", "不分轩轾", "严刑峻制", "依法炮制",
    "依法砲制", "别树一帜", "吮疽舐痔", "吮痈舐痔", "如法泡制", "如法炮制", "如法砲制", "山砠水厓", "川渟岳峙", "拔帜易帜",
    "拔帜树帜", "敬老慈穉", "旗布星峙", "棋布错峙", "渊渟岳峙", "犬牙相制", "独树一帜", "独竖一帜", "瓜分鼎峙", "神牵鬼制",
    "神龙失埶", "自树一帜", "舐痈吮痔", "诡形奇制", "连篇累帙", "逾次超秩", "遭时定制", "锦囊佳制", "锦篇绣帙", "革命创制",
    "鸾停鹄峙", "鸾鹄停峙", "鸿篇巨制", "鸿篇钜制", "鹰击毛挚", "传杯弄盏", "传杯换盏", "花枝招飍", "天诱其衷", "无动于衷",
    "言不由衷", "鼎食鸣锺", "脸红筋涨", "亡国灭种", "断根绝种", "火耕流种", "脸青鼻肿", "闲愁万种", "颠毛种种", "鼻青眼肿",
    "鼻青脸肿", "鼻青额肿", "龙生九种", "龙雏凤种", "一鳞一爪", "一鳞半爪", "一鳞片爪", "东鳞西爪", "修鳞养爪", "张牙舞爪",
    "握拳透爪", "片鳞半爪", "犬牙鹰爪", "锯牙钩爪", "雕心雁爪", "雕心鹰爪", "雪中鸿爪", "雪泥鸿爪", "雪鸿指爪", "雾鳞云爪",
    "飞鸿雪爪", "鸿泥雪爪", "鸿飞雪爪", "鹰心雁爪", "鼓吻奋爪", "一时伯仲", "不分伯仲", "刀耕火种", "火耕水种", "丛轻折轴",
    "插架万轴", "牙签万轴", "牙签犀轴", "牙签玉轴", "牙签锦轴", "秉钧当轴", "秉钧持轴", "群轻折轴", "自出机轴", "锦囊玉轴",
    "天潢贵胄", "气吞宇宙", "簪缨世胄", "诘屈磝碻", "豪门贵胄", "躬擐甲胄", "遥遥华胄", "雨僝云僽", "雨僝风僽", "名韟利鞚",
    "四海九州", "撞府冲州", "破斧缺斨", "赤县神州", "过府冲州", "骑鹤扬州", "鹤背扬州", "千金弊帚", "千金敝帚", "阋墙谇帚",
    "忍俊不住", "招架不住", "按捺不住", "晓行夜住", "心痒难挝", "引玉之砖", "面壁磨砖", "雕虫刻篆", "不可名状", "不可言状",
    "不堪言状", "佹形僪状", "出言无状", "千变万状", "千形万状", "千态万状", "千汇万状", "嘉言善状", "奇形异状", "奇形怪状",
    "妖形怪状", "安于现状", "怪形怪状", "恐慌万状", "惊恐万状", "惊惶万状", "无可名状", "殊形妙状", "殊形诡状", "狼狈万状",
    "莫可名状", "骄泰淫泆", "鬼形怪状", "一饮一啄", "粉妆玉琢", "粉装玉琢", "鸟穷则啄", "掩骼埋胔", "池酒林胾", "无影无踪",
    "来去无踪", "梗迹萍踪", "浪迹浮踪", "浪迹萍踪", "浮迹浪踪", "渺无人踪", "渺无影踪", "觅迹寻踪", "蹑影潜踪", "蹑足潜踪",
    "雨迹云踪", "戎马倥偬", "戎马倥傯", "交梨火枣", "付之梨枣", "囫囵吞枣", "扬葩振藻", "拔葵啖枣", "推梨让枣", "昌歜羊枣",
    "春葩丽藻", "浑沦吞枣", "灾梨祸枣", "重葩累藻", "鸿笔丽藻", "鹘仑吞枣", "先斩后奏", "八音迭奏", "鸾鸣凤奏", "为德不卒",
    "名门世族", "整旅厉卒", "无名小卒", "有始有卒", "毁宗夷族", "瓦合之卒", "簪缨世族", "贩夫驺卒", "身先士卒", "躬先士卒",
    "麟角凤觜", "露钞雪纂", "香培玉琢", "不愧不怍", "化干戈为玉帛", "行不得也哥哥", "如入无人之境", "泰山不让土壤", "觥饭不及壶飧", "毕其功于一役",
    "老虎头上搔痒", "稂不稂莠不莠", "拔赵帜易汉帜", "拔赵帜立赤帜", "猢狲入布袋", "一棒一条痕", "一鞭一条痕", "无所施其伎", "无所施其技", "眼不见为净",
    "事后诸葛亮", "开口见喉咙", "依本画葫芦", "依样画葫芦", "大旱望云霓", "学而优则仕", "单丝不成线", "打鸭惊鸳鸯", "骑鹤上扬州", "骑鹤望扬州",
    "识时务者为俊杰", "东方不亮西方亮", "大树底下好乘凉", "大水冲了龙王庙", "冒天下之大不韪", "勿谓言之不预也", "来而不往非礼也", "放之四海而皆准", "放诸四海而皆准", "丢下耙儿弄扫帚",
    "跑了和尚跑不了庙", "跑了和尚跑不了寺", "不吃羊肉空惹一身膻"
]

export const KillPinyin = [
    {
        "Idiom": "狐狸尾巴",
        "Pinyin": "hú li wěi ba"
    },
    {
        "Idiom": "东方将白",
        "Pinyin": "dong fang jiang bai"
    },
    {
        "Idiom": "导以取保",
        "Pinyin": "dao yi qu bao"
    },
    {
        "Idiom": "不分青白",
        "Pinyin": "bù fēn qīng béi"
    },
    {
        "Idiom": "静影沉璧",
        "Pinyin": "jing ying chen bi"
    },
    {
        "Idiom": "岸谷之变",
        "Pinyin": "àn gǔ zhī bìan"
    },
    {
        "Idiom": "将虾钓鳖",
        "Pinyin": "jiāng xiā diào biē"
    },
    {
        "Idiom": "瓮中之鳖",
        "Pinyin": "wèng zhōng zhī biē"
    },
    {
        "Idiom": "瓮中捉鳖",
        "Pinyin": "wèng zhōng zhuō biē"
    },
    {
        "Idiom": "证龟成鳖",
        "Pinyin": "zhèng guī chéng biē"
    },
    {
        "Idiom": "握粟出卜",
        "Pinyin": "wò sù chū bo"
    },
    {
        "Idiom": "吹毛求疵",
        "Pinyin": "chuī máo qiú cī"
    },
    {
        "Idiom": "吹毛索疵",
        "Pinyin": "chuī máo suǒ cī"
    },
    {
        "Idiom": "大醇小疵",
        "Pinyin": "dà chún xiǎo cī"
    },
    {
        "Idiom": "完美无疵",
        "Pinyin": "wán měi wú cī"
    },
    {
        "Idiom": "批毛求疵",
        "Pinyin": "pī máo qiú cī"
    },
    {
        "Idiom": "披毛求疵",
        "Pinyin": "pī máo qiú cī"
    },
    {
        "Idiom": "澡垢索疵",
        "Pinyin": "zǎo gòu suǒ cī"
    },
    {
        "Idiom": "索垢寻疵",
        "Pinyin": "suǒ gòu xún cī"
    },
    {
        "Idiom": "饰垢掩疵",
        "Pinyin": "shì gòu yǎn cī"
    },
    {
        "Idiom": "心惊胆颤",
        "Pinyin": "xīn jīng dǎn chàn"
    },
    {
        "Idiom": "滴水不羼",
        "Pinyin": "dī shuǐ bù chàn"
    },
    {
        "Idiom": "花枝招颤",
        "Pinyin": "huā zhī zhāo chàn"
    },
    {
        "Idiom": "魂惊胆颤",
        "Pinyin": "hún jīng dǎn chàn"
    },
    {
        "Idiom": "魂飞胆颤",
        "Pinyin": "hún fēi dǎn chàn"
    },
    {
        "Idiom": "清莹秀澈",
        "Pinyin": "qing yin xou che"
    },
    {
        "Idiom": "吾自有处",
        "Pinyin": "wu zi you chu"
    },
    {
        "Idiom": "角立杰出",
        "Pinyin": "jiao li jie chu"
    },
    {
        "Idiom": "诗肠鼓吹",
        "Pinyin": "shī chá gǔ chuì"
    },
    {
        "Idiom": "七拼八凑",
        "Pinyin": "qī pīn bā còu"
    },
    {
        "Idiom": "东拼西凑",
        "Pinyin": "dōng pīn xī còu"
    },
    {
        "Idiom": "东挪西凑",
        "Pinyin": "dōng nuó xī còu"
    },
    {
        "Idiom": "东补西凑",
        "Pinyin": "dōng bǔ xī còu"
    },
    {
        "Idiom": "四方辐辏",
        "Pinyin": "sì fāng fú còu"
    },
    {
        "Idiom": "枉曲直凑",
        "Pinyin": "wǎng qǔ zhí còu"
    },
    {
        "Idiom": "车马辐辏",
        "Pinyin": "chē mǎ fú còu"
    },
    {
        "Idiom": "榆木疙瘩",
        "Pinyin": "yú mù gē da"
    },
    {
        "Idiom": "集矢之的",
        "Pinyin": "jí shǐ zhī de"
    },
    {
        "Idiom": "三好两歹",
        "Pinyin": "sān hǎo liǎng dǎi"
    },
    {
        "Idiom": "不知好歹",
        "Pinyin": "bù zhī hǎo dǎi"
    },
    {
        "Idiom": "不识好歹",
        "Pinyin": "bù shí hǎo dǎi"
    },
    {
        "Idiom": "为非作歹",
        "Pinyin": "wéi fēi zuò dǎi"
    },
    {
        "Idiom": "作好作歹",
        "Pinyin": "zuò hǎo zuò dǎi"
    },
    {
        "Idiom": "做好做歹",
        "Pinyin": "zuò hǎo zuò dǎi"
    },
    {
        "Idiom": "力有未逮",
        "Pinyin": "lì yǒu wèi dǎi"
    },
    {
        "Idiom": "匡其不逮",
        "Pinyin": "kuāng qí bù dǎi"
    },
    {
        "Idiom": "嫌好道歹",
        "Pinyin": "xián hǎo dào dǎi"
    },
    {
        "Idiom": "根连株逮",
        "Pinyin": "gēn lián zhū dǎi"
    },
    {
        "Idiom": "说好嫌歹",
        "Pinyin": "shuō hǎo xián dǎi"
    },
    {
        "Idiom": "说好说歹",
        "Pinyin": "shuō hǎo shuō dǎi"
    },
    {
        "Idiom": "骈首就逮",
        "Pinyin": "pián shǒu jiù dǎi"
    },
    {
        "Idiom": "玉漏犹滴",
        "Pinyin": "yu lou you di"
    },
    {
        "Idiom": "行眠立盹",
        "Pinyin": "xíng mián lì dǔn"
    },
    {
        "Idiom": "鬼怕恶人",
        "Pinyin": "guǐ pà èr én"
    },
    {
        "Idiom": "一股脑儿",
        "Pinyin": "yī gǔ nǎo er"
    },
    {
        "Idiom": "蜗舍荆扉",
        "Pinyin": "wo she jing fei"
    },
    {
        "Idiom": "不置可否",
        "Pinyin": "bù zhì kě fǒu"
    },
    {
        "Idiom": "人涉卬否",
        "Pinyin": "rén shè áng fǒu"
    },
    {
        "Idiom": "唯唯否否",
        "Pinyin": "wěi wěi fǒu fǒu"
    },
    {
        "Idiom": "无所可否",
        "Pinyin": "wú suǒ kě fǒu"
    },
    {
        "Idiom": "献可替否",
        "Pinyin": "xiàn kě tì fǒu",
        "Synonym": "献替可否|进可替否"
    },
    {
        "Idiom": "赏善罚否",
        "Pinyin": "shǎng shàn fá fǒu"
    },
    {
        "Idiom": "进退可否",
        "Pinyin": "jìn tuì kě fǒu"
    },
    {
        "Idiom": "不尴不尬",
        "Pinyin": "bù gān bù gà"
    },
    {
        "Idiom": "不猧不魀",
        "Pinyin": "bù wō bù gà"
    },
    {
        "Idiom": "不间不界",
        "Pinyin": "bù gān bù gà"
    },
    {
        "Idiom": "半间不界",
        "Pinyin": "bàn gān bù gà"
    },
    {
        "Idiom": "半间半界",
        "Pinyin": "bàn gān bàn gà"
    },
    {
        "Idiom": "言简意该",
        "Pinyin": "yán jiǎn yì gāi"
    },
    {
        "Idiom": "言简意赅",
        "Pinyin": "yán jiǎn yì gāi"
    },
    {
        "Idiom": "语简意赅",
        "Pinyin": "yǔ jiǎn yì gāi"
    },
    {
        "Idiom": "辞简义赅",
        "Pinyin": "cí jiǎn yì gāi"
    },
    {
        "Idiom": "口谐辞给",
        "Pinyin": "kǒu xié cí gěi"
    },
    {
        "Idiom": "救过不给",
        "Pinyin": "jiù guò bù gěi"
    },
    {
        "Idiom": "芝草无根",
        "Pinyin": "zhi cao wu geng"
    },
    {
        "Idiom": "楼船箫鼓",
        "Pinyin": "lou chuan xiao gu"
    },
    {
        "Idiom": "狗颠屁股",
        "Pinyin": "gǒu diān pì gu"
    },
    {
        "Idiom": "人民城郭",
        "Pinyin": "rén mín chéng guō"
    },
    {
        "Idiom": "等米下锅",
        "Pinyin": "děng mǐ xià guō"
    },
    {
        "Idiom": "东游西逛",
        "Pinyin": "dōng yóu xī guàng"
    },
    {
        "Idiom": "因袭陈规",
        "Pinyin": "yin xi chen gui"
    },
    {
        "Idiom": "夹枪带棍",
        "Pinyin": "jiā qiāng dài gùn"
    },
    {
        "Idiom": "油头光棍",
        "Pinyin": "yóu tóu guāng gùn"
    },
    {
        "Idiom": "不哼不哈",
        "Pinyin": "bù hēng bù hā"
    },
    {
        "Idiom": "四体百骸",
        "Pinyin": "sì tǐ bǎi hái"
    },
    {
        "Idiom": "四肢百骸",
        "Pinyin": "sì zhī bǎi hái"
    },
    {
        "Idiom": "土木形骸",
        "Pinyin": "tǔ mù xíng hái"
    },
    {
        "Idiom": "放浪形骸",
        "Pinyin": "fàng làng xíng hái"
    },
    {
        "Idiom": "放荡形骸",
        "Pinyin": "fàng dàng xíng hái"
    },
    {
        "Idiom": "易子析骸",
        "Pinyin": "yì zǐ xī hái"
    },
    {
        "Idiom": "相忘形骸",
        "Pinyin": "xiāng wàng xíng hái"
    },
    {
        "Idiom": "杀人如蒿",
        "Pinyin": "shā rén rú hāo"
    },
    {
        "Idiom": "数黄道黑",
        "Pinyin": "shu huang dao hei"
    },
    {
        "Idiom": "刮垢磨痕",
        "Pinyin": "guā gòu mó hén"
    },
    {
        "Idiom": "春梦无痕",
        "Pinyin": "chūn mèng wú hén"
    },
    {
        "Idiom": "一棒一条痕",
        "Pinyin": "yī bàng yī tiáo hén"
    },
    {
        "Idiom": "一鞭一条痕",
        "Pinyin": "yī biān yī tiáo hén"
    },
    {
        "Idiom": "撮科打哄",
        "Pinyin": "cuō kē dǎ hòng"
    },
    {
        "Idiom": "撮科打閧",
        "Pinyin": "cuō kē dǎ hòng"
    },
    {
        "Idiom": "吹唇唱吼",
        "Pinyin": "chuī chún chàng hǒu"
    },
    {
        "Idiom": "河东狮吼",
        "Pinyin": "hé dōng shī hǒu",
        "Synonym": "河东狮子吼"
    },
    {
        "Idiom": "龙鸣狮吼",
        "Pinyin": "lóng míng shī hǒu"
    },
    {
        "Idiom": "奇葩异卉",
        "Pinyin": "qí pā yì hùi"
    },
    {
        "Idiom": "尺二冤家",
        "Pinyin": "chǐ èr yuān jia"
    },
    {
        "Idiom": "钟鼎人家",
        "Pinyin": "zhōng dǐng rén jia"
    },
    {
        "Idiom": "戒奢宁俭",
        "Pinyin": "jie she ning jian"
    },
    {
        "Idiom": "盘水加剑",
        "Pinyin": "pan shui jia jian"
    },
    {
        "Idiom": "浮光跃金",
        "Pinyin": "fu guang yue jin"
    },
    {
        "Idiom": "门不夜扃",
        "Pinyin": "mén bù yè jiōng"
    },
    {
        "Idiom": "划粥割齑",
        "Pinyin": "huà zhōu gē jīu"
    },
    {
        "Idiom": "狼艰狈蹶",
        "Pinyin": "láng jiān bèi juě"
    },
    {
        "Idiom": "同仇敌忾",
        "Pinyin": "tóng chóu dí kài"
    },
    {
        "Idiom": "同心敌忾",
        "Pinyin": "tóng xīn dí kài"
    },
    {
        "Idiom": "敌王所忾",
        "Pinyin": "dí wáng suǒ kài"
    },
    {
        "Idiom": "避阱入坑",
        "Pinyin": "bì jǐng rù kéng"
    },
    {
        "Idiom": "刀枪入库",
        "Pinyin": "dāo qiāng rù kù"
    },
    {
        "Idiom": "坏裳为裤",
        "Pinyin": "huài shang wéi kù"
    },
    {
        "Idiom": "膏梁纨袴",
        "Pinyin": "gāo liáng wán kù"
    },
    {
        "Idiom": "膏梁纨裦",
        "Pinyin": "gāo liáng wán kù"
    },
    {
        "Idiom": "膏粱纨裦",
        "Pinyin": "gāo liáng wán kù"
    },
    {
        "Idiom": "大大咧咧",
        "Pinyin": "dà dà liē liē"
    },
    {
        "Idiom": "钉头磷磷",
        "Pinyin": "ding tou lin lin"
    },
    {
        "Idiom": "依样葫芦",
        "Pinyin": "yī yàng hú lu"
    },
    {
        "Idiom": "打闷葫芦",
        "Pinyin": "dǎ mèn hú lu"
    },
    {
        "Idiom": "愁红惨绿",
        "Pinyin": "chóu hóng cǎn lü"
    },
    {
        "Idiom": "婆婆妈妈",
        "Pinyin": "pó pó mā mā"
    },
    {
        "Idiom": "汲汲忙忙",
        "Pinyin": "ji ji mang mang"
    },
    {
        "Idiom": "兔角龟毛",
        "Pinyin": "tu jiao gui mao"
    },
    {
        "Idiom": "宋才潘面",
        "Pinyin": "sòng cái pān mìan"
    },
    {
        "Idiom": "蔽聪塞明",
        "Pinyin": "bì cōnɡ sè mínɡ"
    },
    {
        "Idiom": "绳愆纠缪",
        "Pinyin": "sheng qian jiu miu"
    },
    {
        "Idiom": "子丑寅卯",
        "Pinyin": "zǐ chǒu yín mǎo"
    },
    {
        "Idiom": "应名点卯",
        "Pinyin": "yìng míng diǎn mǎo"
    },
    {
        "Idiom": "三灾八难",
        "Pinyin": "sān zāi bā nàn"
    },
    {
        "Idiom": "多灾多难",
        "Pinyin": "duō zāi duō nàn"
    },
    {
        "Idiom": "捐躯赴难",
        "Pinyin": "juān qū fù nàn"
    },
    {
        "Idiom": "救苦救难",
        "Pinyin": "jiù kǔ jiù nàn"
    },
    {
        "Idiom": "来日大难",
        "Pinyin": "lái rì dà nàn"
    },
    {
        "Idiom": "毁家纾难",
        "Pinyin": "huǐ jiā shū nàn"
    },
    {
        "Idiom": "百般刁难",
        "Pinyin": "bǎi bān diāo nàn"
    },
    {
        "Idiom": "质疑问难",
        "Pinyin": "zhì yí wèn nàn"
    },
    {
        "Idiom": "鼓鼓囊囊",
        "Pinyin": "gǔ gǔ nāng nāng"
    },
    {
        "Idiom": "无理取闹",
        "Pinyin": "wú lǐ qǔ nào"
    },
    {
        "Idiom": "若敖鬼馁",
        "Pinyin": "ruò áo guǐ něi"
    },
    {
        "Idiom": "天宝当年",
        "Pinyin": "tian bao dang nian"
    },
    {
        "Idiom": "重生爷娘",
        "Pinyin": "chóng shēng yé niáng"
    },
    {
        "Idiom": "金屋娇娘",
        "Pinyin": "jīn wū jiāo niáng"
    },
    {
        "Idiom": "刀耕火耨",
        "Pinyin": "dāo gēng huǒ nòu"
    },
    {
        "Idiom": "深耕易耨",
        "Pinyin": "shēn gēng yì nòu"
    },
    {
        "Idiom": "火耕水耨",
        "Pinyin": "huǒ gēng shuǐ nòu"
    },
    {
        "Idiom": "七担八挪",
        "Pinyin": "qī dān bā nuó"
    },
    {
        "Idiom": "东闪西挪",
        "Pinyin": "dōng shǎn xī nuó"
    },
    {
        "Idiom": "娉婷袅娜",
        "Pinyin": "pīng tíng niǎo nuó"
    },
    {
        "Idiom": "袅袅娜娜",
        "Pinyin": "niǎo niǎo nuó nuó"
    },
    {
        "Idiom": "落魄不偶",
        "Pinyin": "luo tuo bu ou"
    },
    {
        "Idiom": "丽藻春葩",
        "Pinyin": "lì zǎo chūn pā"
    },
    {
        "Idiom": "瑶草琪葩",
        "Pinyin": "yáo cǎo qí pā"
    },
    {
        "Idiom": "百卉千葩",
        "Pinyin": "bǎi huì qiān pā"
    },
    {
        "Idiom": "同源异派",
        "Pinyin": "tóng yuán yì pai"
    },
    {
        "Idiom": "心潮澎湃",
        "Pinyin": "xīn cháo péng pài"
    },
    {
        "Idiom": "拉帮结派",
        "Pinyin": "lā bāng jié pài"
    },
    {
        "Idiom": "汹涌澎湃",
        "Pinyin": "xiōng yǒng péng pài",
        "Synonym": "汹涌彭湃|汹涌渒湃"
    },
    {
        "Idiom": "大雨倾盆",
        "Pinyin": "dà yǔ qīng pén"
    },
    {
        "Idiom": "蚍蜉戴盆",
        "Pinyin": "pí fú dài pén"
    },
    {
        "Idiom": "空头支票",
        "Pinyin": "kōng tóu zhī piào"
    },
    {
        "Idiom": "隐占身体",
        "Pinyin": "yin zhan shen qi"
    },
    {
        "Idiom": "羹藜含糗",
        "Pinyin": "gēng lí hán qiǔ"
    },
    {
        "Idiom": "羹藜唅糗",
        "Pinyin": "gēng lí hán qiǔ"
    },
    {
        "Idiom": "踉踉跄跄",
        "Pinyin": "liàng liàng qiàng qiàng"
    },
    {
        "Idiom": "倒廪倾囷",
        "Pinyin": "dǎo lǐn qīng qūn"
    },
    {
        "Idiom": "韩卢逐逡",
        "Pinyin": "hán lú zhú qūn"
    },
    {
        "Idiom": "矫矫不群",
        "Pinyin": "jiǎo jiǎo bù qùn"
    },
    {
        "Idiom": "曾不惨然",
        "Pinyin": "zeng bu chan ran"
    },
    {
        "Idiom": "余音缭绕",
        "Pinyin": "yú yīn liáo rào"
    },
    {
        "Idiom": "珠围翠绕",
        "Pinyin": "zhū wéi cuì rào"
    },
    {
        "Idiom": "翠围珠绕",
        "Pinyin": "cuì wéi zhū rào"
    },
    {
        "Idiom": "雷惊电绕",
        "Pinyin": "léi jīng diàn rào"
    },
    {
        "Idiom": "黏吝缴绕",
        "Pinyin": "nián lìn jiǎo rào"
    },
    {
        "Idiom": "龙蟠虎绕",
        "Pinyin": "lóng pán hǔ rào"
    },
    {
        "Idiom": "吹叶嚼蕊",
        "Pinyin": "chuī yè jiáo ruǐ"
    },
    {
        "Idiom": "吹花嚼蕊",
        "Pinyin": "chuī huā jiáo ruǐ"
    },
    {
        "Idiom": "浮花浪蕊",
        "Pinyin": "fú huā làng ruǐ"
    },
    {
        "Idiom": "言气卑弱",
        "Pinyin": "yan qi bei ruo"
    },
    {
        "Idiom": "枝叶扶苏",
        "Pinyin": "zhī yè fú sū"
    },
    {
        "Idiom": "滴粉搓酥",
        "Pinyin": "dī fěn cuō sū"
    },
    {
        "Idiom": "累块积苏",
        "Pinyin": "lěi kuài jī sū"
    },
    {
        "Idiom": "钻冰求酥",
        "Pinyin": "zuān bīng qiú sū"
    },
    {
        "Idiom": "骨软筋酥",
        "Pinyin": "gǔ ruǎn jīn sū"
    },
    {
        "Idiom": "骨软肉酥",
        "Pinyin": "gǔ ruǎn ròu sū"
    },
    {
        "Idiom": "水佩风裳",
        "Pinyin": "shuǐ pèi fēng shang"
    },
    {
        "Idiom": "颠衣到裳",
        "Pinyin": "diān yī dào shang"
    },
    {
        "Idiom": "鸿衣羽裳",
        "Pinyin": "hóng yī yǔ shang"
    },
    {
        "Idiom": "精义入神",
        "Pinyin": "jing yi ru shen"
    },
    {
        "Idiom": "货而不售",
        "Pinyin": "huo er bu shou"
    },
    {
        "Idiom": "剔抽禿刷",
        "Pinyin": "tī chōu tū shuā"
    },
    {
        "Idiom": "一推两搡",
        "Pinyin": "yī tuī liǎng sǎng"
    },
    {
        "Idiom": "挠喉捩嗓",
        "Pinyin": "náo hóu liè sǎng"
    },
    {
        "Idiom": "泣血稽颡",
        "Pinyin": "qì xuè jī sǎng"
    },
    {
        "Idiom": "伐毛换髓",
        "Pinyin": "fá máo huàn suǐ"
    },
    {
        "Idiom": "伐毛洗髓",
        "Pinyin": "fá máo xǐ suǐ"
    },
    {
        "Idiom": "剥肤及髓",
        "Pinyin": "bō fū jí suǐ"
    },
    {
        "Idiom": "剥肤椎髓",
        "Pinyin": "bō fū chuí suǐ"
    },
    {
        "Idiom": "怨入骨髓",
        "Pinyin": "yuàn rù gǔ suǐ"
    },
    {
        "Idiom": "恨入骨髓",
        "Pinyin": "hèn rù gǔ suǐ"
    },
    {
        "Idiom": "戳心灌髓",
        "Pinyin": "chuō xīn guàn suǐ"
    },
    {
        "Idiom": "捶骨沥髓",
        "Pinyin": "chuí gǔ lì suǐ"
    },
    {
        "Idiom": "敲膏吸髓",
        "Pinyin": "qiāo gāo xī suǐ"
    },
    {
        "Idiom": "敲骨剥髓",
        "Pinyin": "qiāo gǔ bāo suǐ"
    },
    {
        "Idiom": "敲骨取髓",
        "Pinyin": "qiāo gǔ qǔ suǐ"
    },
    {
        "Idiom": "敲骨吸髓",
        "Pinyin": "qiāo gǔ xī suǐ"
    },
    {
        "Idiom": "敲骨榨髓",
        "Pinyin": "qiāo gǔ zhà suǐ"
    },
    {
        "Idiom": "椎肤剥髓",
        "Pinyin": "chuí fū bō suǐ"
    },
    {
        "Idiom": "沦浃肌髓",
        "Pinyin": "lún jiā jī suǐ"
    },
    {
        "Idiom": "沦肌浃髓",
        "Pinyin": "lún jī jiām suǐ"
    },
    {
        "Idiom": "浃沦肌髓",
        "Pinyin": "jiā lún jī suǐ"
    },
    {
        "Idiom": "深入骨髓",
        "Pinyin": "shēn rù gǔ suǐ"
    },
    {
        "Idiom": "深刺腧髓",
        "Pinyin": "shēn cì shù suǐ"
    },
    {
        "Idiom": "病入骨雜",
        "Pinyin": "bìng rù gǔ suǐ"
    },
    {
        "Idiom": "病入骨髓",
        "Pinyin": "bìng rù gǔ suǐ"
    },
    {
        "Idiom": "痛入骨髓",
        "Pinyin": "tòng rù gǔ suǐ"
    },
    {
        "Idiom": "麟肝凤髓",
        "Pinyin": "lín gān fèng suǐ"
    },
    {
        "Idiom": "龙肝凤髓",
        "Pinyin": "lóng gān fèng suǐ"
    },
    {
        "Idiom": "龙血凤髓",
        "Pinyin": "lóng xuè fèng suǐ"
    },
    {
        "Idiom": "孽根祸胎",
        "Pinyin": "niè gēn huò tāi"
    },
    {
        "Idiom": "心怀鬼胎",
        "Pinyin": "xīn huái guǐ tāi"
    },
    {
        "Idiom": "怀着鬼胎",
        "Pinyin": "huái zhe guǐ tāi"
    },
    {
        "Idiom": "换骨夺胎",
        "Pinyin": "huàn gǔ duó tāi"
    },
    {
        "Idiom": "换骨脱胎",
        "Pinyin": "huàn gǔ tuō tāi"
    },
    {
        "Idiom": "浊骨凡胎",
        "Pinyin": "zhuó gǔ fán tāi"
    },
    {
        "Idiom": "老蚌珠胎",
        "Pinyin": "lǎo bàng zhū tāi"
    },
    {
        "Idiom": "肉眼凡胎",
        "Pinyin": "ròu yǎn fán tāi"
    },
    {
        "Idiom": "龙肝豹胎",
        "Pinyin": "lóng gān bào tāi"
    },
    {
        "Idiom": "湛湛青天",
        "Pinyin": "zhàn zhàn qīng tīan"
    },
    {
        "Idiom": "不落俗套",
        "Pinyin": "bù luò sú tào"
    },
    {
        "Idiom": "成龙配套",
        "Pinyin": "chéng lóng pèi tào"
    },
    {
        "Idiom": "插圈弄套",
        "Pinyin": "chā quān nòng tào"
    },
    {
        "Idiom": "整本大套",
        "Pinyin": "zhěng běn dà tào"
    },
    {
        "Idiom": "生搬硬套",
        "Pinyin": "shēng bān yìng tào"
    },
    {
        "Idiom": "长篇大套",
        "Pinyin": "cháng piān dà tào"
    },
    {
        "Idiom": "陈言老套",
        "Pinyin": "chén yán lǎo tào"
    },
    {
        "Idiom": "以规为瑱",
        "Pinyin": "yǐ guī wéi tiàn"
    },
    {
        "Idiom": "唐临晋帖",
        "Pinyin": "táng lín jìn tiē"
    },
    {
        "Idiom": "服服贴贴",
        "Pinyin": "fú fú tiē tiē"
    },
    {
        "Idiom": "鱼封雁帖",
        "Pinyin": "yú fēng yàn tiē"
    },
    {
        "Idiom": "帘窥壁听",
        "Pinyin": "lián kuī bì tìng"
    },
    {
        "Idiom": "就棍打腿",
        "Pinyin": "jiù gùn dǎ tuǐ"
    },
    {
        "Idiom": "青鞋布袜",
        "Pinyin": "qīng xié bù wà"
    },
    {
        "Idiom": "弃之度外",
        "Pinyin": "qì zhī dù wai"
    },
    {
        "Idiom": "权倾中外",
        "Pinyin": "quán qīng zhōng wai"
    },
    {
        "Idiom": "失马塞翁",
        "Pinyin": "shī mǎ sài wēng"
    },
    {
        "Idiom": "与时消息",
        "Pinyin": "yǔ shí xiāo xi"
    },
    {
        "Idiom": "东窗消息",
        "Pinyin": "dōng chuāng xiāo xi"
    },
    {
        "Idiom": "怀柔天下",
        "Pinyin": "huai rou tian xia"
    },
    {
        "Idiom": "一针见血",
        "Pinyin": "yī zhēn jiàn xiě"
    },
    {
        "Idiom": "轻描淡写",
        "Pinyin": "qīng miáo dàn xiě"
    },
    {
        "Idiom": "柳街花巷",
        "Pinyin": "liǔ jiē huā xiòng"
    },
    {
        "Idiom": "汝成人耶",
        "Pinyin": "nu cheng ren ye"
    },
    {
        "Idiom": "抽抽噎噎",
        "Pinyin": "chōu chōu yē yē"
    },
    {
        "Idiom": "祝哽祝噎",
        "Pinyin": "zhù gěng zhù yē"
    },
    {
        "Idiom": "祝鲠祝噎",
        "Pinyin": "zhù gěng zhù yē"
    },
    {
        "Idiom": "柳夭桃艳",
        "Pinyin": "liǔ yāo táo yèn"
    },
    {
        "Idiom": "拾掇无遗",
        "Pinyin": "shi duo wu yi"
    },
    {
        "Idiom": "坚壁清野",
        "Pinyin": "jiān bì qīng yiě",
        "Synonym": "闭壁清野"
    },
    {
        "Idiom": "没头苍蝇",
        "Pinyin": "méi tóu cāng ying"
    },
    {
        "Idiom": "心烦技痒",
        "Pinyin": "xīn fán jì yǎnɡ"
    },
    {
        "Idiom": "水中捉月",
        "Pinyin": "shui zhong zhuo yue"
    },
    {
        "Idiom": "风姿绰约",
        "Pinyin": "fēng zī chuō yué"
    },
    {
        "Idiom": "丰姿绰约",
        "Pinyin": "fēng zī chuò yuē"
    },
    {
        "Idiom": "丰神绰约",
        "Pinyin": "fēng shén chuò yuē"
    },
    {
        "Idiom": "义正辞约",
        "Pinyin": "yì zhèng cí yuē"
    },
    {
        "Idiom": "云期雨约",
        "Pinyin": "yún qī yǔ yuē"
    },
    {
        "Idiom": "厉行节约",
        "Pinyin": "lì xíng jié yuē"
    },
    {
        "Idiom": "幽期密约",
        "Pinyin": "yōu qī mì yuē"
    },
    {
        "Idiom": "桑中之约",
        "Pinyin": "sāng zhōng zhī yuē"
    },
    {
        "Idiom": "桑间之约",
        "Pinyin": "sāng jiān zhī yuē"
    },
    {
        "Idiom": "由博返约",
        "Pinyin": "yóu bó fǎn yuē"
    },
    {
        "Idiom": "百年之约",
        "Pinyin": "bǎi nián zhī yuē"
    },
    {
        "Idiom": "背盟败约",
        "Pinyin": "bèi méng bài yuē"
    },
    {
        "Idiom": "莺期燕约",
        "Pinyin": "yīng qī yàn yuē"
    },
    {
        "Idiom": "蹈矩循彟",
        "Pinyin": "dǎo jǔ xún yuē"
    },
    {
        "Idiom": "隐隐约约",
        "Pinyin": "yǐn yǐn yuē yuē"
    },
    {
        "Idiom": "三舖八菹",
        "Pinyin": "sān ní bā zū"
    },
    {
        "Idiom": "衣食税租",
        "Pinyin": "yī shí shuì zū"
    },
    {
        "Idiom": "风尘肮脏",
        "Pinyin": "feng chen ang zang"
    },
    {
        "Idiom": "指囷相赠",
        "Pinyin": "zhǐ què xiāng zèng"
    },
    {
        "Idiom": "鱼釜尘甑",
        "Pinyin": "yú fǔ chén zèng"
    },
    {
        "Idiom": "走为上着",
        "Pinyin": "zǒu wèi shàng zhaō"
    },
    {
        "Idiom": "引狗入寨",
        "Pinyin": "yǐn gǒu rù zhai"
    },
    {
        "Idiom": "恩不放债",
        "Pinyin": "ēn bù fàng zhai"
    },
    {
        "Idiom": "龙游曲沼",
        "Pinyin": "long you qu zhao"
    },
    {
        "Idiom": "弊帚自珍",
        "Pinyin": "bì zhǒu zì zhén"
    },
    {
        "Idiom": "放之四海而皆准",
        "Pinyin": "fàng zhī sì hǎi ér jiē zhǔn"
    },
    {
        "Idiom": "放诸四海而皆准",
        "Pinyin": "fàng zhū sì hǎi ér jiē zhǔn"
    },
    {
        "Idiom": "一鳞一爪",
        "Pinyin": "yī lín yī zhǎo"
    },
    {
        "Idiom": "一鳞半爪",
        "Pinyin": "yī lín bàn zhǎo"
    },
    {
        "Idiom": "一鳞片爪",
        "Pinyin": "yī lín piàn zhǎo"
    },
    {
        "Idiom": "东鳞西爪",
        "Pinyin": "dōng lín xī zhǎo"
    },
    {
        "Idiom": "修鳞养爪",
        "Pinyin": "xiū lín yǎng zhǎo"
    },
    {
        "Idiom": "张牙舞爪",
        "Pinyin": "zhāng yá wǔ zhǎo"
    },
    {
        "Idiom": "握拳透爪",
        "Pinyin": "wò quán tòu zhǎo"
    },
    {
        "Idiom": "片鳞半爪",
        "Pinyin": "piàn lín bàn zhǎo"
    },
    {
        "Idiom": "犬牙鹰爪",
        "Pinyin": "quǎn yá yīng zhǎo"
    },
    {
        "Idiom": "锯牙钩爪",
        "Pinyin": "jù yá gōu zhǎo"
    },
    {
        "Idiom": "雕心雁爪",
        "Pinyin": "diāo xīn yàn zhǎo"
    },
    {
        "Idiom": "雕心鹰爪",
        "Pinyin": "diāo xīn yīng zhǎo"
    },
    {
        "Idiom": "雪中鸿爪",
        "Pinyin": "xuě zhōng hóng zhǎo"
    },
    {
        "Idiom": "雪泥鸿爪",
        "Pinyin": "xuě ní hóng zhǎo"
    },
    {
        "Idiom": "雪鸿指爪",
        "Pinyin": "xuě hóng zhǐ zhǎo"
    },
    {
        "Idiom": "雾鳞云爪",
        "Pinyin": "wù lín yún zhǎo"
    },
    {
        "Idiom": "飞鸿雪爪",
        "Pinyin": "fēi hóng xuě zhǎo"
    },
    {
        "Idiom": "鸿泥雪爪",
        "Pinyin": "hóng ní xuě zhǎo"
    },
    {
        "Idiom": "鸿飞雪爪",
        "Pinyin": "hóng fēi xuě zhǎo"
    },
    {
        "Idiom": "鹰心雁爪",
        "Pinyin": "yīng xīn yàn zhǎo"
    },
    {
        "Idiom": "鼓吻奋爪",
        "Pinyin": "gǔ wěn fèn zhǎo"
    },
    {
        "Idiom": "当务始终",
        "Pinyin": "dang wu shi zhong"
    },
    {
        "Idiom": "丛轻折轴",
        "Pinyin": "cóng qīng zhé zhóu"
    },
    {
        "Idiom": "插架万轴",
        "Pinyin": "chā jià wàn zhóu"
    },
    {
        "Idiom": "牙签万轴",
        "Pinyin": "yá qiān wàn zhóu"
    },
    {
        "Idiom": "牙签犀轴",
        "Pinyin": "yá qiān xī zhóu"
    },
    {
        "Idiom": "牙签玉轴",
        "Pinyin": "yá qiān yù zhóu"
    },
    {
        "Idiom": "牙签锦轴",
        "Pinyin": "yá qiān jǐn zhóu"
    },
    {
        "Idiom": "秉钧当轴",
        "Pinyin": "bǐng jūn dāng zhóu"
    },
    {
        "Idiom": "秉钧持轴",
        "Pinyin": "bǐng jūn chí zhóu"
    },
    {
        "Idiom": "群轻折轴",
        "Pinyin": "qún qīng zhé zhóu"
    },
    {
        "Idiom": "自出机轴",
        "Pinyin": "zì chū jī zhóu"
    },
    {
        "Idiom": "锦囊玉轴",
        "Pinyin": "jǐn náng yù zhóu"
    },
    {
        "Idiom": "山复整妆",
        "Pinyin": "shan fu zheng zhuang"
    },
    {
        "Idiom": "欲谁归罪",
        "Pinyin": "yu shui gui zhui"
    },
    {
        "Idiom": "身无立锥",
        "Pinyin": "sheng wu li zhui"
    },
    {
        "Idiom": "一塌刮子",
        "Pinyin": "yī tā guā zi"
    },
    {
        "Idiom": "不随以止",
        "Pinyin": "bu shui yi zi"
    },
    {
        "Idiom": "思所逐之",
        "Pinyin": "si shuo zhu zi"
    },
    {
        "Idiom": "折而族之",
        "Pinyin": "zhe er zu zi"
    },
    {
        "Idiom": "江湖骗子",
        "Pinyin": "jiāng hú piàn zi"
    },
    {
        "Idiom": "河东狮子",
        "Pinyin": "hé dōng shī zi"
    },
    {
        "Idiom": "牢什古子",
        "Pinyin": "láo shí gǔ zi"
    },
    {
        "Idiom": "缺口镊子",
        "Pinyin": "quē kǒu niè zi"
    },
    {
        "Idiom": "耍嘴皮子",
        "Pinyin": "shuǎ zuǐ pí zi"
    },
    {
        "Idiom": "马上房子",
        "Pinyin": "mǎ shàng fáng zi"
    },
    {
        "Idiom": "先斩后奏",
        "Pinyin": "xiān zhǎn hòu zòu"
    },
    {
        "Idiom": "八音迭奏",
        "Pinyin": "bā yīn dié zòu"
    },
    {
        "Idiom": "鸾鸣凤奏",
        "Pinyin": "luán míng fèng zòu"
    },
    {
        "Idiom": "露钞雪纂",
        "Pinyin": "lù chāo xuě zuǎn"
    },
    {
        "Idiom": "香培玉琢",
        "Pinyin": "xiang pei yu zuo"
    }
]

export const KillLetter = [
    {
        "Idiom": "七拼八凑",
        "Pinyin": "qī pīn bā còu",
        "Explain": "指把零碎的东西拼凑起来。引申为胡乱凑合。"
    },
    {
        "Idiom": "东拼西凑",
        "Pinyin": "dōng pīn xī còu",
        "Explain": "比喻零乱地加以拼凑。"
    },
    {
        "Idiom": "四方辐辏",
        "Pinyin": "sì fāng fú còu",
        "Explain": "比喻四方的人才或货物像车轮上的辐条聚集在毂上那样汇集到一处◇引申为从各方聚集的意思。"
    },
    {
        "Idiom": "枉曲直凑",
        "Pinyin": "wǎng qǔ zhí còu",
        "Explain": "指在弯曲的路上却笔直地往前走。形容人笨拙死板而不知变通。"
    },
    {
        "Idiom": "车马辐辏",
        "Pinyin": "chē mǎ fú còu",
        "Explain": "辐辏形容人或货物像车轮上的辐条聚集在车毂上一样。指车马集聚拥挤。"
    },
    {
        "Idiom": "不置可否",
        "Pinyin": "bù zhì kě fǒu",
        "Explain": "置：放，立；可：行；否：不行。不说行，也不说不行。指不表明态度。"
    },
    {
        "Idiom": "人涉卬否",
        "Pinyin": "rén shè áng fǒu",
        "Explain": "别人涉水过河，而我独不渡◇用以比喻自有主张，不随便附和。"
    },
    {
        "Idiom": "唯唯否否",
        "Pinyin": "wěi wěi fǒu fǒu",
        "Explain": "唯唯：回答时表示同意的应声；否否：别人说否，自己也跟着说否。形容胆小怕事，一味顺从。"
    },
    {
        "Idiom": "无所可否",
        "Pinyin": "wú suǒ kě fǒu",
        "Explain": "不赞同也不反对。"
    },
    {
        "Idiom": "献可替否",
        "Pinyin": "xiàn kě tì fǒu",
        "Explain": "献：进；替：废。指劝善归过，提出兴革的建议。",
        "Synonym": "献替可否|进可替否"
    },
    {
        "Idiom": "赏善罚否",
        "Pinyin": "shǎng shàn fá fǒu",
        "Explain": "指赏赐善人善事，惩罚恶人恶事。同赏善罚恶”。"
    },
    {
        "Idiom": "进退可否",
        "Pinyin": "jìn tuì kě fǒu",
        "Explain": "指进升合格者，黜退不合格者。"
    },
    {
        "Idiom": "口谐辞给",
        "Pinyin": "kǒu xié cí gěi",
        "Explain": "指言辞诙谐敏捷。"
    },
    {
        "Idiom": "救过不给",
        "Pinyin": "jiù guò bù gěi",
        "Explain": "犹救过不赡。补救过失都来不及。"
    },
    {
        "Idiom": "金屋娇娘",
        "Pinyin": "jīn wū jiāo niáng",
        "Explain": "指高贵而美丽之女子。"
    },
    {
        "Idiom": "刀耕火耨",
        "Pinyin": "dāo gēng huǒ nòu",
        "Explain": "耨：除草。古人播种前先伐去树木烧掉野草，以灰肥田。泛指原始的耕作技术。"
    },
    {
        "Idiom": "深耕易耨",
        "Pinyin": "shēn gēng yì nòu",
        "Explain": "易耨：勤于除草。深耕细做，及时除草。比喻精心耕种。"
    },
    {
        "Idiom": "火耕水耨",
        "Pinyin": "huǒ gēng shuǐ nòu",
        "Explain": "耨：除草。古代一种原始耕种方式。"
    },
    {
        "Idiom": "柳夭桃艳",
        "Pinyin": "liǔ yāo táo yèn",
        "Explain": "形容女子貌美。"
    },
    {
        "Idiom": "坚壁清野",
        "Pinyin": "jiān bì qīng yiě",
        "Explain": "对付强敌入入侵的一种方法。使敌人既攻不下据点，又抢不到物资。",
        "Synonym": "闭壁清野"
    }
]